{"path":"docs/wallets/0.1/trinity/references/faq","templateID":1,"sharedPropsHashes":{},"localProps":{"markdown":"# Seed migration FAQ\n\n**These are frequently asked questions about the recent Trinity attack and the seed migration tool.**\n\n## What do I have to do to be safe?\n\nDepending on when and how you used the Trinity wallet, you may need to take steps to [protect your Trinity account](../how-to-guides/protect-trinity-account.md).\n\n![Seed migration flowchart](/assets/docs/wallets/0.1/trinity/images/seed-migration.png)\n\n## Were my IOTA tokens stolen?\n\nIf you see any value transactions that you did not send in your Trinity history, your IOTA tokens may have been stolen. Please see the Identity Verification Process.\n\nIf you don't see any value transactions in your Trinity history, but your balance is wrong, see the [Troubleshooting guide](../references/troubleshooting.md) for help or reach out to the IOTA Foundation on [Discord](https://discord.iota.org/).\n\n:::warning:\nPlease be aware that some users are impersonating members of the IOTA Foundation on Discord. Therefore, it is important that you contact members directly by clicking their names in the right-hand panel under 'IOTA Foundation'.\n:::\n\n## When will the Coordinator be restarted?\n\nThe Coordinator will be restarted on 10 March 2020 to give users enough time to [protect their Trinity accounts](../how-to-guides/protect-trinity-account.md).\n\n## The Coordinator was paused, does this mean that IOTA is centralized?\n\nThe [Coordinator](/docs/getting-started/0.1/network/the-coordinator) is a centralized finality device, which provides security during the network’s infancy.\n\nThe Coordinator will be removed when we have an implementation of all [Coordicide](https://coordicide.iota.org/) modules.\n\n## How do I transfer my IOTA tokens?\n\nWhile the [Coordinator](/docs/getting-started/0.1/network/the-coordinator) is paused, no one can transfer their IOTA tokens on the Mainnet.\n\nWe recommend reading [this guide](../how-to-guides/protect-trinity-account.md) if you want to migrate your IOTA tokens to a new seed before the Coordinator is restarted.\n\n## Is it safe to share my addresses with others?\n\nYes. Addresses are public information and can be seen on Tangle explorers such as https://thetangle.org/.\n\n:::warning:\nNever share your seed or Ledger phrases with anyone.\n:::\n\n## Can the Coordinator repay the stolen IOTA tokens?\n\nNo. The [Coordinator](/docs/getting-started/0.1/network/the-coordinator) cannot transfer IOTA tokens.\n\nHowever, the IOTA Foundation may consult with community node owners to discuss the option of a global snapshot.\n\nDuring a global snapshot, and pending node owner validation, at-risk IOTA tokens would be transferred to a secure seed until their owners can verify their identities.\n\n## I use the IOTA light wallet, do I have to do anything? Will it still work after the Coordinator is restarted?\n\nThe attack affected only the Trinity wallet. If you have never used Trinity, you don't need to do anything. When the Coordinator is restarted, you can use the light wallet to transfer IOTA tokens again.\n\n## Can I migrate directly to a Ledger hardware wallet?\n\nNo. To transfer your IOTA tokens to a Ledger account, you should do the following:\n\n1. [Install the latest version of Trinity and update your password](../how-to-guides/protect-trinity-account.md#install-the-latest-version-of-trinity)\n\n2. [Migrate your IOTA tokens to a new seed](../how-to-guides/protect-trinity-account.md#migrate-your-iota-tokens-to-a-new-seed)\n\n3. From 10 March 2020, [set up a ledger account](https://trinity.iota.org/hardware/) and transfer your IOTA tokens from your new seed to the Ledger\n\n## What can I do if I miss the seed migration period?\n\nThe migration period ends on 7 March 2020. If you did not migrate your seed before this date, we recommend [creating a new account in Trinity](../how-to-guides/create-an-account.md) and transferring your IOTA tokens to an address on your new seed either on or after 10 March 2020.\n\nIf you think that your IOTA tokens were stolen, reach out to the IOTA Foundation on [Discord](https://discord.iota.org/).\n\n:::warning:\nPlease be aware that some users are impersonating members of the IOTA Foundation on Discord. Therefore, it is important that you contact members directly by clicking their names in the right-hand panel under 'IOTA Foundation'.\n:::\n\n## What happens if the attacker uses the Seed Migration Tool with a stolen seed?\n\nIf more than one person uses the Seed Migration Tool to migrate the same seed, the owner of the seed will need to go through the [Identity Verification Process](#what-is-the-idenitity-verification-process) to validate their ownership.\n\n## What is the Identity Verification Process?\n\nTo protect at-risk IOTA tokens, the IOTA Foundation may consult with community node owners to discuss the option of a global snapshot.\n\nDuring a global snapshot, and pending node owner validation, at-risk IOTA tokens would be transferred to a secure seed until their owners can verify their identities\n\nAt-risk IOTA tokens include:\n\n- Those that are known to have been stolen during the attack\n- Those that belong to a seed that was migrated by two or more people\n\nIf you own any at-risk IOTA tokens, you may need to complete a KYC (know your customer) process with a third party to reclaim them.\n\nMore information on the process as well as the consequences for all affected users will be provided soon. Please see the [status page](http://status.iota.org/) for updates.\n\n## Will my pending transactions be confirmed when the Coordinator is restarted?\n\nIf you use the Seed Migration Tool to [migrate your IOTA tokens to a new seed](../how-to-guides/protect-trinity-account.md#migrate-your-iota-tokens-to-a-new-seed), any pending transactions that you sent before the Coordinator was paused will not be confirmed.\n\nIf you don't use the Seed Migration Tool, any pending transactions that you sent before the Coordinator was paused may still be confirmed.\n","title":"シード移行 FAQ | 参考資料 | Trinity | ウォレット"}}
