{"path":"docs/client-libraries/0.1/account-module/introduction/overview","templateID":1,"sharedPropsHashes":{},"localProps":{"markdown":"# Account module overview\n\n**The account module is a stateful package that simplifies IOTA payments without you having to worry about withdrawing from spent addresses or promoting and reattaching pending transactions.**\n\n## How the account module works\n\nThe account module allows you to build an account object that keeps track of your seed state in a local database.\n\nTo see your seed state, you can export it, allowing you to back it up and/or import it into another account.\n\n### Example of an exported seed state\n\nThese are examples of exported seed states in Go, Java, and JavaScript:\n\n--------------------\n### Go\n```json\n{\n    // The ID of the account.\n    // The account's ID is the hash of the account's address with index 0 and security level 2\n    \"id\":\"9KYMSUEUSOVQN9CPOHVHRNSYTZGBHTWYWR9LGJGYATUMQVNYFQXTEOLEMEACONMAR9AELKPVRCMGQ9MMD\",\n    // The date that the seed state was exported\n    \"date\":\"2019-12-09T11:32:25.1705032Z\",\n    // The last key index that was used to generate the addresses.\n    // This allows the account to make sure it generates a new address\n    \"key_index\":2,\n    // Active addresses, their conditions, and their security levels.\n    // These allow the account to prevent withdrawals from addresses that may still receive deposits\n    \"deposit_addresses\":{\n        \"1\":{\n            \"timeout_at\":\"2019-12-10T11:29:02.23687483Z\",\n            \"multi_use\":true,\n            \"security_level\":2\n        },\n        \"2\":{\n            \"timeout_at\":\"2019-12-10T11:32:09.549810701Z\",\n            \"multi_use\":true,\n            \"security_level\":3\n        }\n    },\n    // Trytes of any pending transfer bundles.\n    // These allow the account to monitor pending transactions and rebroadcast or reattach them if necessary\n    \"pending_transfers\":{}\n}\n```\n---\n### Java\n```json\n{\n    // The date that the seed state was exported\n    \"exportedDate\":1575890827622,\n    // The ID of the account.\n    // The account's ID is the hash of the account's address with index 0 and security level 2\n    \"id\":\"NJJHM9IKUAK9DF9B9WIHYSGQPLOPMJYEWXOYXN9BHCTCLLQKGYFDKFDWNYSQJLFFMJCABVDMG9S9DH9FY\",\n    \"state\":{\n        // The last key index that was used to generate the addresses.\n        // This allows the account to make sure it generates a new address\n        \"keyIndex\":2,\n        // Active addresses, their conditions, and their security levels.\n        // These allow the account to prevent withdrawals from addresses that may still receive deposits\n        \"depositRequests\":{\n            \"0\":{\n                \"request\":{\n                    \"timeOut\":1575977014862,\n                    \"multiUse\":true,\n                    \"expectedAmount\":0\n                    },\n                \"securityLevel\":2\n            },\n            \"1\":{\n                \"request\":{\n                    \"timeOut\":1575977051855,\n                    \"multiUse\":true,\n                    \"expectedAmount\":0\n                    },\n                \"securityLevel\":3\n            }\n        },\n    // Trytes of any pending transfer bundles.\n    // These allow the account to monitor pending transactions and rebroadcast or reattach them if necessary\n    \"pendingTransfers\":{},\n    // Whether the account is new (no generated addresses)\n    \"new\":false\n    }\n}\n```\n---\n### JavaScript\n```json\n{\n    // The last key index that was used to generate the addresses.\n    // This allows the account to make sure it generates a new address\n    \"lastKeyIndex\": 2,\n    // Active addresses, their conditions, and their security levels.\n    // These allow the account to prevent withdrawals from addresses that may still receive deposits\n    \"deposits\":[\n        {\n            \"address\":\"RDRPSRBQPEJFRXXJYOUF9AZKAWOSHKZFDOMXJQHLOFAOMVPTQEKDKDKTKQJQ9QKGQHSJGQQZCHTAVCLUW\",\n            \"index\":2,\n            \"security\":3,\n            \"timeoutAt\":1575974515544,\n            \"multiUse\":false,\n            \"expectedAmount\":0\n        },\n        {\n            \"address\":\"YDXSBOKPKVXLCSGAGBLY9XGPQQFHEWDNQIHTXIHIKQGEYVU9RBUPE9GRZMPXNLDRBUZTDOQFF9NIASMYC\",\n            \"index\":1,\n            \"security\":2,\n            \"timeoutAt\":1575974481246,\n            \"multiUse\":false,\n            \"expectedAmount\":0\n        }],\n    // Trytes of any pending transfer bundles.\n    // These allow the account to monitor pending transactions and rebroadcast or reattach them if necessary\n    \"withdrawals\":[]\n}\n```\n--------------------\n\n## Conditional deposit addresses\n\nOne of the many benefits of using accounts is that you can define conditions in which your addresses are active or expired. These conditions help senders to decide whether it's safe to send tokens to an address. For this reason, addresses in accounts are called _conditional deposit addresses_ (CDA).\n\nAccounts use CDAs to help reduce the risk of withdrawing from [spent addresses](/docs/getting-started/0.1/clients/addresses#spent-addresses). When you request IOTA tokens from someone, you can create a CDA that's active for a certain period of time. This way, you let the sender know that you intend to withdraw from that address only after that time. As a result, the sender can decide whether to make a deposit, depending on how much time is left on a CDA.\n\n### Conditions of a CDA\n\nWhen you create a CDA, you must specify the `timeout_at` field to define whether it's active or expired.\n\nYou can also specify one of the following recommended fields:\n\n- **multi_use (recommended):** A boolean that specifies if the address may receive more than one deposit.\n- **expected_amount (recommended):** The amount of IOTA tokens that the address is expected to receive. When the address contains this amount, it's considered expired. We recommend specifying this condition.\n\n|  **Combination of fields** | **Withdrawal conditions**\n| :----------| :----------|\n|`timeout_at` |The CDA can be used in withdrawals as long as it contains IOTA tokens|\n|`timeout_at` and `multi_use` (recommended) |The CDA can be used in withdrawals as soon as it expires, regardless of how many deposits were made to it|\n|`timeout_at` and `expected_amount` (recommended) | The CDA can be used in withdrawals as soon as it contain the expected amount|\n\n:::warning:Warning\nIf a CDA was created with only the `timeout_at` field, it can be used in withdrawals as soon as it has a non-zero balance even if it hasn't expired. Therefore, to avoid withdrawing from a spent address, we recommend creating CDAs with either the `multi_use` field or with the `expected_amount` field whenever possible.\n:::\n\n### Advice for creating CDAs\n\nWhen creating a CDA, you should consider the following questions.\n\n#### How long should you specify in a CDA's timeout?\n\nThe value that you specify in the `timeout_at` field depends on how fast you expect the depositor to make a deposit. If you are in direct contact with the depositor and you are both waiting to settle the transfer, you can specify a shorter timeout.\n\n:::danger:Important\nIf a CDA was created with only the `timeout_at` field, it can be used in outgoing payments as soon as it has a non-zero balance even if it hasn't expired. So, to avoid withdrawing from a spent address, we recommend creating CDAs with either the `multi_use` field or with the `expected_amount` field whenever possible.\n:::\n\n#### When should you create a multi-use CDA?\n\nWe recommend that you use multi-use CDAs when the following conditions are true:\n\n- You expect multiple payments of arbitrary value from multiple depositors.\n- You fully control the creation and sharing of the CDA, for example on your website.\n- When you cannot share a CDA with the `expected_amount` field value set with each depositor individually.\n\nOr when communicating with depositors who reliably request a new CDA when the `timeout_at` field value is running out.\n\nOne scenario for `multi_use` CDA addresses is sharing a donation address on a website or other digital medium, such as a screen. In this scenario, you can receive multiple deposits of arbitrary value and you fully control the sharing of the CDA. You can refresh the CDA on the website or screen each time the CDA is 72 hours before its `timeout_at` value runs out. This gives depositors enough time to finalize the payments they may have sent before you refreshed the CDA.\n\n#### When should you create a CDA with an expected amount?\n\nYou should specify the value of the `expected_amount` field when the value of the deposit is clear from both the depositor's and the receiver's point of view. For example, when you want to withdraw from an exchange, you can give the exchange a CDA with the expected amount that you want to withdraw.\n","title":"概要 | 序説 | アカウントモジュール | CLライブラリ"}}
