{"path":"docs/general/0.1/how-to-guides/expose-your-local-device","templateID":1,"sharedPropsHashes":{},"localProps":{"markdown":"# Expose your local device to the Internet\n\n**To connect a device to those outside of your local network, you need to expose it to the Internet. A common reason to expose your local device to the Internet is to connect an IOTA node to neighbors.**\n\nTo expose your local device to the Internet, you must forward ports from your router to your device. By doing so, any connections to your router's IP address on those ports will be forwarded to your device.\n\nBefore you can create port forwarding rules, you need a static IP address both on your local network and the Internet. If you already have these, [go straight to port forwarding](#create-a-port-forwarding-rule).\n\n## Get a static IP address on your local network\n\nOn many private networks, whenever a new device connects to it, the device is assigned a new internal IP address from a DHCP (dynamic host configuration protocol) server, which is usually a router.\n\nTo avoid changing port forwarding rules, you need the internal IP address of your local device to stay the same. Otherwise, you'd need to update your port forwarding rules every time your IP address were to change.\n\n### Prerequisites\n\nTo complete this guide, you must have a Linux Ubuntu 18.04 server. If you don't have a Linux server and you're running a Windows or Mac operating system, you can [run one in a virtual machine](../how-to-guides/set-up-virtual-machine.md).\n\n---\n\n**Note:** Many ways exists to get a static IP on your local network, and this guide is just one way of doing so.\n\n1. Find your gateway IP address (router's IP address) and make a note of it\n\n    ```bash\n    route -n\n    ```\n\n2. Find both the current internal IP address of your Linux server and the netmask length, and make a note of them\n\n    ```bash\n    ifconfig | grep netmask\n    ```\n\n    **Note:** In the output, the internal IP address is next to `inet`. Ignore the 127.0.0.1 IP address, this is your localhost. For the netmask, 255 represents 8 bits. Therefore the netmask length in this example is 3*8, which results in a length of 24.\n\n3. Open the network configuration file\n\n    ```bash\n    sudo nano /etc/netplan/01-netcfg.yaml\n    ```\n\n4. Copy and paste the following into the file\n\n    ```yaml\n    # This file describes the network interfaces available on your system\n    # For more information, see netplan(5).\n    network:\n    version: 2\n    renderer: networkd\n    ethernets:\n        ens33:\n        dhcp4: no\n        dhcp6: no\n        addresses: [192.168.1.77/24]\n        gateway4: 192.168.1.1\n        nameservers:\n            addresses: [1.1.1.1,8.8.8.8]\n    ```\n\n    **Note:** Replace the value of the `gateway4` field to your gateway IP address. In the `addresses` field, replace the value on the left of the forward slash (/) with the internal IP address of your Linux server and replace the value on the right with the netmask length.\n\n5. Apply your changes\n\n    ```bash\n    sudo netplan apply\n    ```\n\n**Important:** If your network configuration changes, for example you change your router, you may lose connection to your device. In this case, you should physically connect to your device and update the 01-netcfg.yaml file with a new static IP address.\n\n## Get a domain name for your router\n\nTo allow external devices to connect to your device through the Internet, your router needs a static IP address on the Internet. Unfortunately, Internet service providers often give your router a dynamic IP address, which changes at regular intervals. As a result, any connections to your device will be lost when its IP address changes. Therefore, you need to use a dynamic DNS (DDNS) service to get a public domain name that is linked to your dynamic IP address. With a DDNS, your device will report the actual public IP to the DDNS server every few minutes, so it can update its records for your domain name.\n\n**Note:** In this task, we use Duck DNS, but many other DDNS services exist.\n\n1. [Create a Duck DNS account](https://www.duckdns.org/) and add a subdomain\n\n    ![Duck DNS sub domain](/assets/docs/general/0.1/duckdns-subdomain.png)\n\n2. [Install the scripts](https://www.duckdns.org/install.jsp) that will send your IP address to Duck DNS at regular intervals. Make sure you select the correct operating system for your device and select your subdomain from the dropdown. Then, follow the instructions.\n\n    ![Duck DNS installation](/assets/docs/general/0.1/duckdns-install.png)\n\nNow that your router has a static IP address, you can create port forwarding rules to forward connections to your device.\n\n## Create a port forwarding rule\n\nTo expose a local device to the Internet, you must create port forwarding rules, which forward requests from certain ports of your router's IP address to your local device's internal IP address.\n\n### Prerequisites\n\nTo complete this guide, you need the following:\n\n* Administrator access to your router\n* A [static IP address on your local network](#get-a-static-ip-address-on-your-local-network).\n* A static IP address for your router, or if it has a dynamic IP address, a [domain name from a dynamic DNS service](#get-a-domain-name-for-your-router)\n\n---\n\nAll routers are different. In this guide, the router is a BT Hub 6, as a result the steps in this guide may be different for your router, but the concepts are the same. \n\n1. In a web browser, enter the IP address of your router. This IP address should be displayed on your router. If you can't see it, find it in the command prompt. You'll see your router's IP address under the `Gateway` column.\n\n    ```bash\n    route -n\n    ```\n\n2. Go to **Advanced settings**\n\n    ![Advanced settings for a BT Hub 6 router](/assets/docs/general/0.1/router-bt-hub.png)\n\n3. Click **Firewall**\n\n    ![Firewall settings for a BT Hub 6 router](/assets/docs/general/0.1/router-advanced-settings.png)\n\n4. Create a new rule by doing the following:\n\n    * Enter any name for your rule\n    * Select your local device from the dropdown\n    * Enter a port that you want to use to connect to your local device from the Internet\n    * Select a protocol that the router should listen to\n\n    ![Example of a port forwarding rule](/assets/docs/general/0.1/port-forwarding-rule.png)\n\n5. You may need to restart your router for the rules to take effect\n\n6. Test your rules by checking that the port is open on your public IP address. To test your rules, you could use an online tool such as [yougetsignal.com](https://www.yougetsignal.com/tools/open-ports/).","title":"Expose your local device to the Internet | How-to Guides | General"}}
