{"path":"docs/node-software/0.1/chronicle/references/architecture","templateID":1,"sharedPropsHashes":{},"localProps":{"markdown":"# Chronicle architecture\n\n**One Chronicle node manages and supervises all the shards in a Scylla swarm. It does this by establishing at least one independent connection to each shard, which is supervised by the core app in the umbrella project.**\n\n![Scylla swarm](/assets/docs/node-software/0.1/chronicle/images/scylla-swarm.jpg)\n\nIn this diagram, the Chronicle node consists of the green components between the IRI node and the Scylla swarm. The node contains the umbrella project, API services, the core app, the ZMQ messenger, and the explorer service.\n\n![Chronicle node architecture](/assets/docs/node-software/0.1/chronicle/images/chronicle-node.jpg)\n\n## Umbrella project\n\nAn Umbrella project is a space where independent apps coexist and communicate through Inter-Process Communication (IPC). Each app runs under its own supervision tree, which allows it to grow and easily migrate to its own rack (a cluster with its own umbrella project).\n\nTo allow Chronicle to scale up, it uses Elixir [umbrella projects](https://elixir-lang.org/getting-started/mix-otp/dependencies-and-umbrella-projects.html#umbrella-projects) to split code into multiple apps and arrange them under an umbrella project.\n\nThe Chronicle umbrella project includes a core app that communicates with the Scylla swarm to do the following:\n\n* Manage database changes\n* Forward the changes to the swarm\n* Monitor cluster supervisors\n\nOther apps use the core app to communicate with the Scylla swarm through IPC. These apps can hold the business rules that need to interact with the core app.\n\nApps take turns to run by using a preemptive scheduling process that's based on a round-robin algorithm.\n\n![Umbrella project](/assets/docs/node-software/0.1/chronicle/images/umbrella-project.png)\n\n## Core app\n\nThe Chronicle core app may be an independent microservice or it may be dependent on other apps. For example, a Chronicle app may depend on the shared core app to access the Tangle.","title":"アーキテクチャー | 参考文献 | クロニクル | ノードSW"}}
