{"path":"docs/wallets/0.1/hub/how-to-guides/configure-hub","templateID":1,"sharedPropsHashes":{},"localProps":{"markdown":"# Plan your Hub configuration\n\n**Before you run Hub, you should consider whether you need to override some of its default settings to meet your needs. This guide gives you some advice about what to consider when configuring Hub.**\n\n## What should you consider before running Hub?\n\nIf you start Hub and have data in the database, you must delete that data before changing any of these options:\n\n- [`--apiAddress`](../references/command-line-options.md#apiAddress): Nodes in an IOTA network keep a record of the balances of addresses. If you connect to a node in a different [IOTA network](/docs/getting-started/0.1/network/iota-networks), that node will not have the same record, so any balances in Hub will be invalid.\n\n- [`--salt`](../references/command-line-options.md#salt): If you change the salt, Hub won't be able to generate the seed for any deposit addresses that are already in the database. As a result, Hub won't be able to generate the correct private keys to be able to sign sweeps that withdraw from those deposit addresses.\n\n- [`--keySecLevel`](../references/command-line-options.md#keySecLevel): If you change the security level, the signatures that Hub creates will be invalid for any deposit address that are already in the database.\n\n- [Any Argon2 options](../references/command-line-options.md#argon2-hash-function): These options affect the [Argon2](https://www.argon2.com/) hash function, which is used to generate seeds. Any changes to these options will result in seeds that do not match the deposit addresses.\n\n## Which IOTA network do you want to use?\n\nWhen choosing an IOTA network, you need to consider the following options:\n\n- [`--apiAddress`](../references/command-line-options.md#apiAddress)\n\n- [`--minWeightMagnitude`](../references/command-line-options.md#minWeightMagnitude)\n\n- [`--powMode`](../references/command-line-options.md#powMode)\n\n- [`--useHttpsIRI`](../references/command-line-options.md#useHttpsIRI)\n\n### --apiAddress\n\nHub needs to connect to a node's API to be able to interact with the [Tangle](/docs/getting-started/0.1/network/the-tangle). To avoid connecting to a malicious node, we recommend connecting Hub to a local node that you control. If you don't have a local node, read about the [IRI node software](/docs/node-software/0.1/iri/introduction/overview) for guides on setting one up.\n\n#### Development environment\n\nWhen testing Hub in a development environment, you should consider connecting to a node on the [Devnet](/docs/getting-started/0.1/network/iota-networks#devnet). This IOTA network requires less [proof of work](/docs/getting-started/0.1/transactions/proof-of-work), which reduces the time it takes to create [sweeps](../concepts/sweeps.md), and it uses [free test IOTA tokens](/docs/getting-started/0.1/how-to-guides/get-test-tokens).\n\nAs well as the Devnet, you can also connect to a node in a [private Tangle](/docs/compass/0.1/introduction/overview), which allows you to configure your own IOTA network.\n\n#### Production environment\n\nWhen deploying Hub in a production environment, you should connect to a node on the [Mainnet](/docs/getting-started/0.1/network/iota-networks#mainnet). \n\n### --minWeightMagnitude\n\nDepending on the IOTA network of the node, set the correct [minimum weight magnitude](/docs/getting-started/0.1/network/minimum-weight-magnitude).\n\n### --powMode\n\nSome nodes do not support remote [proof of work](/docs/getting-started/0.1/transactions/proof-of-work). In this case, configure Hub to use local proof of work. This option uses computational power on the device that is running Hub.\n\n### --useHttpsIRI\n\nSome nodes use the SSL protocol to encrypt their API connection. In this case,  configure Hub to use the SSL protocol.\n\n## What rate of withdrawals and deposits do you expect?\n\nThe length of time is takes to process withdrawals depends on the following options:\n\n- [`--sweepInterval`](../references/command-line-options.md#sweepInterval)\n\n- [`--sweep_max_deposit`, `--sweep_max_withdrawal`](../references/command-line-options.md#sweepLimits), and [`--keySecLevel`](../references/command-line-options.md#keySecLevel)\n\n- [`--attachmentInterval`](../references/command-line-options.md#attachmentInterval)\n\n### --sweepInterval\n\nHub processes withdrawals in sweeps, which are done at regular sweep intervals.\n\nThe sweep interval that you choose should depend on the rate of withdrawals and deposits that you expect.\n\nIf the sweep interval is frequent, Hub will create small sweeps that process fewer withdrawals more often. \n\nIf the sweep interval is infrequent, Hub will create large sweeps that process more withdrawals less often.\n\nLarge sweeps are not recommended because they contain more transactions, which each require a proof of work. Therefore, a larger sweep will take longer to create, and may take longer to be confirmed.\n\nAs a result, you should also consider the maximum amount of withdrawals and deposits you want to include in a single sweep.\n\n### --sweep_max_deposit, --sweep_max_withdrawal, and --keySecLevel\n\nIn a sweep, each deposit consists of an output transaction, and each withdrawal consists of at least one input transaction, depending on the security level of addresses in Hub.\n\nTo limit the amount of time it takes to create a sweep and for the transactions in it to be confirmed, you should consider the maximum amount of deposits and withdrawals that should be included in a sweep.\n\nFor example, if you use security level 3, each withdrawal will consist of three transactions. If the maxmimum number of withdrawals is 7, a sweep could include 21 transactions just for withdrawals.\n\n### --attachmentInterval\n\nWhen Hub sends a sweep to a node, it monitors it to check for confirmation. If the sweep takes longer than the attachment interval to become confirmed, Hub [promotes and reattaches](/docs/getting-started/0.1/transactions/reattach-rebroadcast-promote) its tail transaction.\n\nThe attachment interval you choose should depend on the current rate of confirmed transactions per second (CTPS) on the Tangle. To check the current rate, see [tanglebeat.com](http://tanglebeat.com/).\n\nFor example, if the current CTPS rate is between 3 and 4 minutes, you should wait at least 4 minutes before reattaching or promoting transactions in a sweep.\n\nIf the attachment interval is too frequent, you will create unnecessary bundles to promote and reattach the sweep.\n\nIf the attachment interval is too infrequent, sweeps may take longer than necessary to be confirmed.\n\n## Next steps\n\n[Install and run Hub](../how-to-guides/install-hub.md).","title":"ハブを構成する | ハウツーガイド | ハブ | ウォレット"}}
