{"path":"docs/iota-basics/0.1/introduction/overview","templateID":1,"sharedPropsHashes":{},"localProps":{"markdown":"# IOTA basics overview\n\n**An IOTA network consists of nodes and clients. A node is a device that has read/write access to a ledger of transactions. A client is a device that has a seed. A seed gives a client access to [addresses](../concepts/addresses-and-signatures.md). Addresses have a balance, which defines the amount of IOTA tokens in them. To withdraw IOTA tokens from their addresses, clients must send bundles of transactions to a node so that the nodes can validate the transactions and update their ledgers.**\n\n## Clients\n\nLike an account number and sort code, an address in IOTA is a unique string of 81 characters ([trytes](../concepts/trinary.md)) that are unique to each seed.\n\n:::info:\nSometimes addresses have 90 characters. The extra 9 characters are called the checksum, which helps you make sure your address is correct.\n:::\n\nClients on the network send each other data or IOTA tokens to each other's addresses in [bundles, which contain transactions](../concepts/bundles-and-transactions.md).\n\nTransactions are objects that are [structured according to the rules (protocol) of the nodes in the IOTA network](../references/structure-of-a-transaction.md). Each transaction is an operation that instructs a node to withdraw IOTA tokens, deposit IOTA tokens, or simply store the transaction.\n\n:::info:\nThe IOTA [client libraries](/docs/client-libraries/0.1/introduction/overview) contain all the tools you need, including those to create addresses and bundles.\n\nAny code that uses a seed is executed on the client side. Your seed never leaves your device.\n:::\n\n## Nodes\n\nNodes are like a cross between a post office and a bank. They keep a ledger of every transaction that they receive and the non-zero balances of all addresses in the network.\n\nNodes have an [API](/docs/iri/0.1/references/api-reference), which allows clients to read from the ledger and send bundles.\n\nNodes [validate transactions](/docs/iri/0.1/concepts/transaction-validation) according to a set of rules, one of which states that withdrawals must contain a valid [signature](../concepts/addresses-and-signatures.md). When a transaction is considered valid, the node adds it to its ledger and updates the balances of the affected addresses.\n\n### Trust\n\nYou might be wondering how you can trust a node. After all, connecting to a node is the only way to read from and write to the Tangle. What if a node were to change the response to an API endpoint such as [`getBalances`](/docs/iri/0.1/references/api-reference#getBalances)? How would you know what your real balance is?\n\nWell, IOTA is a [distributed ledger technology](/docs/getting-started/0.1/introduction/what-is-dlt). The word _distributed_ is the key. When a node receives a transaction, validates it, and appends it to its ledger, it doesn't stop there. The IOTA protocol states that all nodes must forward transactions onto other nodes, called their neighbors. This way, all nodes receive, validate, and store a consistent, distributed ledger of transactions, removing the need to trust any individual. As a result, you can send requests to multiple nodes and check the consistency of the returned data.\n\n### Immutability\n\nWhat stops a node from being able to change a transaction?\n\nThe first step to transaction immutability is to hash its contents into 81 trytes. This hash is unique to the transaction. If one character of the transaction's contents were to be changed, the hash would be invalid.\n\nThe next step is to connect the transaction (called a child) to two others (called its parents) by referencing their transaction hashes in the `branchTransaction` and `trunkTransaction` fields. Now, the fate of the child transaction is bound to its parent. If the contents of either parents change, their transaction hashes will be invalid, making the child invalid.\n\nThis connected structure in the ledger is what's called [the Tangle](/docs/the-tangle/0.1/introduction/overview), a tangled family of transaction hashes where any new orphaned child (with no parents), called a tip transaction, must reference two parents. As a result, the more children a transaction has, the more transaction hashes that are connected to it, and the more immutable it is considered.\n\n### Scalability\n\nScalability is the capability of a network to handle a growing amount of work. In IOTA, where billions of Internet-of-things devices are expected to transact on the network, scalability is essential.\n\nYou've already seen that transactions reference each other to strengthen their immutability in the Tangle. But, what's also important about the the Tangle is how parents are chosen.\n\nBefore a client can send a transaction to a node, that transaction must reference two parents. Transactions, up to the last one in a bundle, will always reference each other in their `trunkTransaction` fields. So, what about the `branchTransaction` field and the `trunkTransaction` and `branchTransaction` fields of the last transaction in the bundle?\n\nThe parents in these fields are chosen by a node during [tip selection](/docs/the-tangle/0.1/concepts/tip-selection). A process where a node starts from an old transaction and traverses its children, grandchildren, and so on, until it finds one without any parents (the selected tip).\n\nWhile traversing transactions, the node must [validate their entire bundle](/docs/iri/0.1/concepts/transaction-validation#bundle-validator). As a result, by having the node validate the history of the tip transactions and by referencing their transaction hashes, **a child approves its parents' bundles and their entire history**.\n\nBecause every bundle approves two new bundles, the more bundles in the network, the faster new ones are approved.\n\n","title":"Overview | Introduction | IOTA Basics"}}
