{"path":"docs/blueprints/0.1/p2p-energy/overview","templateID":1,"sharedPropsHashes":{},"localProps":{"markdown":"# Peer-to-peer energy grid\n\n**Although the supply of energy is often automated, the payment system is expensive to integrate and often requires manual intervention. By creating a peer-to-peer energy grid with IOTA, you can automate the transfer of power and the payment for that power. This automation makes your infrastructure more dynamic and easier to update.**\n\nThis blueprint demonstrates how entities in a peer-to-peer (P2P) energy grid can trade energy. The distributed and machine-based nature of the P2P energy grid make this an ideal use case for IOTA. Using IOTA technologies, you can create an infrastructure where even low-powered devices can communicate with the grid in a traceable and immutable way.\n\nTrading energy on a P2P energy grid involves four high-level entities:\n\n**Entity** | **Role**\n---|---\nSource|Generate electricity such as solar or wind for a producer|\nProducer| Manage several sources and receive payment from the grid\nConsumer |Use the power provided by the grid in return for payment|\nGrid| Coordinate the distribution of power from the producers to the consumers, and distribute payments|\n \n\n![P2P Energy PoC - Use Case Picture](/assets/docs/blueprints/0.1/p2p-energy/p2p_use_case.png)\n\n:::info:\nThis blueprint can be replicated in any scenario where a resource is distributed to consumers in return for payment, for example water supply.\n:::\n\n## Glossary\n\n* IRI - The IOTA reference implementation is the reference implementation of the IOTA node software\n* MAM - Masked Authentication Messaging is a second layer data communication protocol which adds functionality to emit and access an encrypted data stream, like RSS, over the Tangle https://blog.iota.org/introducing-masked-authenticated-messaging-e55c1822d50e\n* source - an entity in the PoC that supplied energy\n* producer - an entity in the PoC that aggregates information from Sources and supplied that information to the Grid\n* consumer - an entity that uses power from the Grid and is charged for its use\n* grid - the grid processes information from Producers and Consumers to create payment channels\n\n## Additional resources\n\n* [IRI repository](https://github.com/iotaledger/iri) \n* [MAM repository](https://github.com/iotaledger/mam.client.js)\n* [iota.js repository](https://github.com/iotaledger/iota.js)\n\n\n","title":"Overview | P2P energy grid | App Blueprints"}}
