{"path":"docs/trinity/0.1/how-to-guides/send-a-transaction","templateID":1,"sharedPropsHashes":{},"localProps":{"markdown":"# Send a transaction\n\n**Trinity has a user interface that allows you to send multiple transactions at the click of a button.**\n\nIf you have multiple accounts in your Trinity wallet, make sure that you select the correct account from the dropdown menu.\n\n:::info:\nTo send to an address in Trinity, it must include the 9-tryte checksum. If you generated a new address in Trinity, that address will already include the checksum.\n:::\n\n1. Click **Send**\n\n2. Enter a recipient's address\n\n  :::danger:Important\n  On Android devices, any application can read the content of keyboard presses and modify it. Be careful when pasting an address into Trinity and make sure that the address you have pasted is the same one that you copied.\n  :::\n\n3. Enter either a message, or an amount of IOTA tokens, or both\n\n    :::info:\n    The amount to send can be entered in units of IOTA or in the [currency of your choice](../how-to-guides/change-the-general-settings.md). Pay close attention to the [IOTA units](/docs/iota-basics/0.1/references/units-of-iota-tokens) (i, Mi, Gi,) that you're sending.\n    :::\n\n    :::info:\n    Accounts that are linked to hardware wallets can't send value transactions with a message.\n    \n    If you're using a hardware wallet, you can send either IOTA tokens or a message, but not both.\n    :::\n\n    ![IOTA units](/assets/docs/trinity/0.1/images/sending-value-highlighted.jpg)\n    \n4. Click **Send**\n\n    ![Sending IOTA tokens](/assets/docs/trinity/0.1/images/send.jpg)\n\n    :::info:\n    If you minimize Trinity Mobile while sending a transaction, the sending process pauses until you reopen it.\n    :::\n\nWhen you either receive or send a transaction, it appears on the home page. Click a transaction from the list to view information about it.\n\n![A received transaction](/assets/docs/trinity/0.1/images/trinity-receive-message.png)\n\n:::info:\nThe Addresses field is displayed only in [Advanced mode](../how-to-guides/change-the-advanced-settings.md).\n:::\n\n","title":"トランザクションを送信する | ハウツーガイド | トリニティ"}}
