{"path":"docs/getting-started/0.1/introduction/what-is-a-bundle","templateID":1,"sharedPropsHashes":{},"localProps":{"markdown":"# What is a bundle?\n\n**A bundle is a group of one or more transactions, which send data or instruct a node to transfer IOTA tokens from certain addresses to others. The fate of each transaction in a bundle depends on the rest. Either all transactions are valid or none of them are.**\n\nThe structure of a bundle consists of a head, a body, and a tail, where the tail is index 0 and the head is the last transaction in the bundle.\n\nAll transactions, starting from the tail, are connected by reference to the one with the next index. For example, the tail transaction is connected to transaction 1, which is connected to transaction 2, and so on. These connections allow nodes to reconstruct bundles and validate their contents.\n\nTo attach transactions to the Tangle, the head transaction is connected to the tails of two other bundles in the Tangle. (The tail and body transactions are connected to one of those tails as well.) These tail transactions are selected by nodes during [tip selection](/docs/the-tangle/0.1/concepts/tip-selection).\n\n## Example of a bundle that transfers IOTA tokens\n\nTo transfer IOTA tokens, a bundle must contain at least one input and one output transaction. These bundles are called transfer bundles.\n\nIn this example, you want to send 100Mi to recipient A, and your balance is distributed among three addresses:\n\n* **Address 0:** 20Mi\n* **Address 1:** 30Mi\n* **Address 2:** 55Mi\n\nWhen you send 100Mi to recipient A, the following transactions are created and sent to a node as a transfer bundle:\n\n* **Input transaction:** Withdraw 100Mi from my address and check the signature to verify that I own it\n* **Output transaction:** Deposit 100Mi to the recipient's address\n* **Output transaction:** Deposit the remaining 5Mi from address 2 into address 3\n\n:::danger:\n[You must not withdraw from an address more than once](/docs/iota-basics/0.1/concepts/addresses-and-signatures#address-reuse). So, a transfer bundle may require an extra output transaction to deposit the remaining balance of a withdrawn address into a new address.\n:::\n\n[Learn more about bundles](/docs/iota-basics/0.1/concepts/bundles-and-transactions).\n\n","title":"バンドルとは？ | 前置き | 入門"}}
