{"path":"docs/general/0.1/how-to-guides/set-up-virtual-machine","templateID":1,"sharedPropsHashes":{},"localProps":{"markdown":"# Set up a Linux server on a virtual machine\n\n**Many of the IOTA tutorials and guides require a Linux operating system. If your computer is running a different operating system, you can use Linux inside a virtual machine.**\n\nLinux is an open-source operating system, which can come in packages called distributions. Each Linux distribution includes different built-in software for different goals.\n\nOne of the most popular Linux distributions is Ubuntu, which is the distribution that we use in our examples.\n\nLinux is beneficial for the following reasons:\n* Linux runs on many hardware platforms\n* Linux distributions are open-source and almost all of them are free to use\n* Linux is secure, reliable, and lightweight\n\n**Note:** If you don't want to run a Linux virtual machine on your own computer, you can rent the use of a cloud computer from a company such as Amazon. By using this approach, you don't need to worry about port forwarding or running out of memory. Amazon AWS has a setup guide for [launching a Linux virtual machine on their cloud](https://aws.amazon.com/getting-started/tutorials/launch-a-virtual-machine/).\n\n## Set up a Linux server\n\nTo run a Linux server on a Windows or Mac operating system, you must install a virtual machine and run Linux on it.\n\n1. [Download and install VirtualBox for Windows or Mac](https://www.virtualbox.org/wiki/Downloads)\n\n2. If you're on a Windows, [download and install the latest version of 7 Zip](https://www.7-zip.org/). If you're on a Mac, download and install the [Unarchiver application](https://itunes.apple.com/us/app/the-unarchiver/id425424353).\n\n3. [Download the Ubuntu Server file (18.04 LTS)](https://www.ubuntu.com/download/server)\n\n4. Go to the folder where you saved the file. If you're on a Windows, right-click the file and click **Extract here**. If you're on a Mac, double-click the file to extract it.\n\n5. Open VirtualBox, and click **New**\n\n6. Enter a name for your server, and use the slider to select the amount of RAM memory you'd like to dedicate to it\n\n    ![Create a new virtual machine](/assets/docs/general/0.1/virtual-machine-setup.png) \n\n7. Follow the on-screen instructions and choose the default settings\n\n8. Select your server from the list and click **Start**\n\n9. In the window, open the file explorer and select the Ubuntu Server file that you downloaded in step 3\n\n    ![Virtual machine window](/assets/docs/general/0.1/select-virtual-image.png)\n\nCongratulations :tada: You've got a Linux server running on your computer!\n\nOur guides always require the use of a command prompt, so navigate to the Terminal application and open it.\n\n## Connect to your Linux server\n\nWhen Linux is running in a virtual machine, it's separated from the rest of your host operating system. As a result, you can't copy commands from outside the virtual machine and paste them into it.\n\nTo connect to your Linux server that's running on the same network, you can use a [secure shell](https://www.ssh.com/ssh/) (SSH) client.\n\n### Configure your Linux server as an SSH server\n\nBefore your Linux server can understand messages that use the SSH protocol, you must configure it as an SSH server.\n\n1. In the terminal of your Linux server, upgrade your software packages\n\n    ```bash\n    sudo apt-get upgrade\n    ```\n\n2. Install the network tools\n\n    ```bash\n    sudo apt install net-tools\n    ```\n\n3. Install an SSH server\n\n    ```bash\n    sudo apt-get install openssh-server\n    ```\n\n4. Close your Linux server, select your server from the list, and go to **Settings** > **Network**\n\n5. In the Adapter 1 tab, change the **Attached to** field to **Bridged Adapter**\n\n6. Start your Linux server, open the terminal and find out the IP address of your Linux server\n\n    ```bash\n    ifconfig\n    ```\n\n7. Make a note of the `inet` IP address\n\n    ![Linux server IP address](/assets/docs/general/0.1/linux-server-ip-address.png)\n\n### Establish an SSH connection to your Linux server\n\nWhen your Linux server is configured as an SSH server, you can connect to it from your host operating system.\n\nTo establish an SSH connection to your Linux server on a **Mac**, do the following:\n\n1. Open the Terminal application. The fastest way to get there is by pressing `CMD+spacebar` and entering `terminal` in the search bar.\n\n2. Establish an ssh connection. Change the IP_ADDRESS_FROM_STEP_7 placeholder with the IP address of your Linux server.\n\n    ```bash\n    ssh $IP_ADDRESS_FROM_STEP_7\n    ```\n\nTo establish an SSH connection to your Linux server on a **Windows**, do the following:\n\n1. [Download and install PuTTy](https://www.ssh.com/ssh/putty/download#sec-Download-PuTTY-installation-package-for-Windows)\n\n2. Open PuTTy\n\n3. Enter the IP address of your Linux server and click **Open**\n\n    ![PuTTy configuration](/assets/docs/general/0.1/connect-putty-to-linux-server.PNG)\n\nYou're now connected to your Linux server over SSH. Enter Linux commands in the PuTTy or host terminal to run them on your Linux server.\n\n","title":"Set up a Linux server on a virtual machine | How-to Guides | General"}}
