{"path":"docs/the-tangle/0.1/introduction/overview","templateID":1,"sharedPropsHashes":{},"localProps":{"markdown":"# The Tangle overview\n\n**Before you send a bundle, you must attach your transactions to two existing ones in the network. You do this so that the node can walk on the connections to find and validate each transaction. These connections form a data structure that's called the Tangle. Transactions in the Tangle can be in one of two states: Pending or confirmed.**\n\nThe data structure that forms the Tangle is a type of [directed acyclic graph](https://en.wikipedia.org/wiki/Directed_acyclic_graph) (DAG), and it was formally introduced in the IOTA whitepaper by Professor Serguei Popov in 2015.\n\nIn the Tangle, transactions are connected to each other by reference through their [`branchTransaction` and `trunkTransaction` fields](/docs/iota-basics/0.1/references/structure-of-a-transaction). These fields contain the transaction hash of either a transaction in the same bundle or a tip transaction that was returned during [tip selection](../concepts/tip-selection.md).\n\nReferences form a family tree, whereby if a transaction is a **child**, the branch and trunk transactions are its **parents**.\n\n![A directed acyclic graph](/assets/docs/the-tangle/0.1/images/dag.png)\n\nIn this diagram, transaction 6 directly references transaction 5, so transaction 5 is a **parent** of transaction 6. On the other hand, transaction 6 indirectly references transaction 3, so, transaction 3 is a **grandparent** of transaction 6.\n\nBecause tip selection causes nodes to validate bundles, any transaction that directly or indirectly references other transactions approves them and their entire history.\n\n:::info:\nTransaction 0 is the genesis transaction, which is the very first transaction in the Tangle.\n:::\n\n## Consensus\n\nIn IOTA, the nodes must reach a consensus about when a transaction can be considered confirmed before they can update the balances of addresses.\n\nA transaction is considered confirmed when it's directly or indirectly referenced by a [Coordinator](../concepts/the-coordinator.md)-issued milestone.\n\n## Further research\n\nWe have an active research department that focuses on developing the Tangle and its related protocols.\n\n:::info:Coordicide\nAt the moment, we are focused on a project called [Coordicide](https://coordicide.iota.org/), which is our proposal for the removal of the Coordinator. When this happens, nodes will be able to reach a consensus without milestones.\n:::\n\n* [Academic Papers](https://www.iota.org/research/academic-papers)\n* [Roadmap](https://www.iota.org/research/roadmap)\n","title":"Overview | Introduction | The Tangle"}}
