{"path":"docs/iot/0.1/how-to-guides/connect-a-I2C-sensor","templateID":1,"sharedPropsHashes":{},"localProps":{"markdown":"# Connect to an I2C sensor\n\n**I2C is a protocol that allows one device to exchange data with one or more connected devices through the use of a single data line and clock signal. In this guide, you connect an I2C sensor to an nRF52 microcontroller so that they can communicate with each other.**\n\n## Prerequisites\n\nTo complete this guide, you need the following:\n\n- An nRF52 series microcontroller\n- An I2C sensor development board\n\n## Connect a single sensor to your microcontroller\n\n1. Connect the SCL and SDA pins to the microcontroller\n    \n    :::info:\n    RIOT OS assigns pins P0.26 and P0.27 to the I2C protocol.\n    :::\n        \n    | **Microcontroller** | **I2C sensor** |\n    |-----------------|------------|\n    |      P0.26      |     SDA    |\n    |      P0.27      |     SCL    |\n\n    \n:::info:\nThe nRF52 has a feature called [EasyDMA](https://infocenter.nordicsemi.com/index.jsp?topic=%2Fcom.nordic.infocenter.nrf52832.ps.v1.1%2Feasydma.html&cp=3_1_0_9&anchor=easydma), which allows you to [assign wire protocols to any pin](https://infocenter.nordicsemi.com/index.jsp?topic=%2Fcom.nordic.infocenter.nrf52832.ps.v1.1%2Ftwim.html&cp=3_1_0_32&anchor=concept_scx_f5p_xr).\n:::\n\n## Connect multiple sensors to your microcontroller\n\nBecause multiple sensors can use the same SDA line, the microcontroller needs a way to distinguish them and talk to a single sensor at a time. The I2C protocol uses the concept of device addressing to coordinate traffic on the data line.\n\nIf you're connecting more than one I2C sensor to your microcontroller, you need to make sure that each one has a unique 7-bit address.\n\nMost I2C integrated circuits allow you to select I2C addresses to avoid address conflicts with other devices.\n\nYou should always check the datasheet of your sensor before using it. Generally, sensors have a PIN that you need to pull up or down to select the I2C address.\n    \n","title":"Connect an I2C sensor | How-to Guides | IoTプロジェクト"}}
