{"path":"docs/iot/0.1/concepts/flashing","templateID":1,"sharedPropsHashes":{},"localProps":{"markdown":"# Flashing\n\n**To allow a microcontroller to run your application, you need to flash the binary code onto its flash memory, using a programmer.**\n\nOn a normal PC or single-board computer, the operating system is on a storage system such as HDD, SDD, SD Card, or eMMC.\nBefore your system can run the operating system, it must run [firmware](https://en.wikipedia.org/wiki/Firmware#Personal_computers) to communicate with the storage system.\n\nMicrocontrollers on the other hand run only the firmware, which includes the embedded [real-time operating system](https://en.wikipedia.org/wiki/Real-time_operating_system)(RTOS).\n\nWhen you write an application for an RTOS, you compile everything into one binary and flash it onto the flash memory of the microcontroller. Then, the microcontroller runs the compiled code.\n\n:::info:\nSome microcontrollers, such as the Arduino Uno, use a bootloader, which does a similar job as the firmware on a PC or SBC. \nThe bootloader adds some logic to the microcontroller, so that you are able to program the microcontroller through USB.\nA bootloader is more use-friendly because you don't need additional hardware to start programming the microcontroller. But, the bootloader uses unnecessary space on the flash memory, which could be used by your application.\n:::\n\n## How flashing works\n\nMicrocontrollers have the following interfaces that are used for flashing:\n\n* [Serial Wire Debug](http://www.ti.com/lit/wp/spmy004/spmy004.pdf)\n* [JTAG](https://en.wikipedia.org/wiki/JTAG)\n\nBoth of these interfaces use the same protocol, but have different pin counts.\n\nTo flash binary code onto the microcontroller, you need to use a device called programmer.\n\nJ-Link is one of the most famous general programmers. You can program most microcontrollers with J-Link.\n\nOther programmers exist for microcontrollers that are made by specific companies. For example, the [STLinkV2](https://www.st.com/en/development-tools/st-link-v2.html) is used to program microcontrollers made by [STMicroelectronics](https://de.wikipedia.org/wiki/STMicroelectronics).\n ","title":"Flashing | 概念 | IoTプロジェクト"}}
