{"path":"docs/blueprints/0.1/tangle-data-storage/overview","templateID":1,"sharedPropsHashes":{},"localProps":{"markdown":"# Tangle data storage overview\n\n**Data boosts innovation for public and private sector organisations, and can be used to create new revenue streams. However, without a vendor-neutral way of verifying data, it can't be trusted. This blueprint uses the IOTA Tangle as an immutable data structure to verify the contents of a file in a third-party storage solution.**\n\n## Business case\n\nStoring, sharing and trading data is a cornerstone of business in the connected world and boosts innovation for public and private sector organisations. However, if you can't trust that the data has not been altered, then the data becomes nearly useless. By using the IOTA Tangle, businesses and connected machines will be able to easily provide veracity, security, and privacy for the data they share.\n\n### Challenge\n\nA common requirement for nearly all use cases or applications is that data must be stored for later use, for example:\n\n* **Supply chain:** Shipping documents or images must be stored to form a permanent record of events\n* **Digital twin of a vehicle:** All data such as the odometer readings, maintenance record, and ownership change should be stored to form a permanent record of the entire lifecycle of the vehicle\n\nHowever, the Tangle is not a database. The Tangle is an immutable, distributed ledger which allows you to store a hash of data and a pointer to its location in third-party data storage.\n\n:::info:\nAlthough permanent storage on the Tangle isn't currently possible, the IOTA Foundation are developing a solution that will allow it. This solution is called permanodes.\n:::\n\n### Solution\n\nBy creating a cryptographic hash of the document at the source and storing the hash in the Tangle, you have a method of proving that the data is unchanged. In addition, you may also want the data to remain private and allow only authorized users to view it as well as be able to revoke this authorization when needed. By using any standard encryption method, the data can be secured and only visible to those with the corresponding decryption key.\n\nWhen you use the Tangle with a third-party data storage solution as described in this blueprint, your data is immutably secured and timestamped, without having to attach all of it to the Tangle.\n\n## Demo\n\nSee this website for a [demonstration of the application](https://ipfs.iota.org/).\n\n## Additional Resources\n\n---------------\n#### GitHub repository ####\n[Link](https://github.com/iotaledger/poc-ipfs)\n\nRead the code and some quickstart instructions to test this blueprint.\n---\n#### iota.js client library ####\n[Link](/docs/iota-js/0.1/README)\n\nLearn how to use the iota.js client library to create, send, and receive transactions.\n---\n#### IPFS ####\n[Link](https://ipfs.io/)\n\nThis blueprint stores files on IPFS, then attaches the immutable, permanent IPFS links to the Tangle. This secures your content, without having to put the whole file on the Tangle.\n---------------\n","title":"Overview | Tangle Data Storage | アプリ設計図"}}
