{"path":"docs/trinity/0.1/how-to-guides/manage-your-account","templateID":1,"sharedPropsHashes":{},"localProps":{"markdown":"# Manage your account\n\n**Trinity allows you to have multiple accounts, each of which has a unique seed.**\n\nFor each of your accounts, you can do the following:\n\n* Access your seed (not available if you use a hardware wallet)\n* View your addresses and their available balance\n* Change the name of an account\n\nMake sure that you select the correct account to manage before completing any of these tasks.\n\nTo access Account management on a mobile device, go to **Settings** > **Account management**.\n\nTo access Account management on a desktop, go to the burger menu >  **Account** > **Account management**.\n\n![Account management](/assets/docs/trinity/0.1/images/account-management-menu.png)\n\n## Access your seed\n\nEach account that you create uses a different seed.\n\nTo access the seed, go to Account management, and click **View seed**.\n\n## View your addresses\n\nEach seed can be used to generate an almost unlimited number of addresses.\n\nTo view the addresses that you've generated, go to Account management, and click **View addresses**.\n\n:::info:\nA red line through the center of an address means that the address has been spent. Trinity stops you from withdrawing IOTA tokens from spent addresses, so you must never deposit IOTA tokens into them. To find out why, [learn how signatures are created](/docs/iota-basics/0.1/concepts/addresses-and-signatures#address-reuse).\n::: \n\n## Change your account's name\n\nTo make it easier to manage multiple accounts, you can give each of them a unique name.\n\nTo change the name of an account, go to Account management, and click **Account name**.\n\n## Change your login password\n\nTrinity stores your seeds for you (unless you use a [hardware wallet](../concepts/hardware-wallet.md)) and allows you to log in with a password.\n\nTo change the login password on a desktop, go to **Settings** > **Change password**.\n\nTo change the login password on a mobile device, go to **Settings** > **Security settings** > **Change password**.\n\n![Change password](/assets/docs/trinity/0.1/images/settings-password.jpg)\n","title":"Manage your account | How-to Guides | Trinity Wallet"}}
