{"path":"docs/iot/0.1/how-to-guides/get-started-with-microcontrollers","templateID":1,"sharedPropsHashes":{},"localProps":{"markdown":"# Get started with microcontroller development\n\n**In this guide, you learn how to get started with the nRF52 series of microcontrollers. When you've completed this guide, you'll be able to follow our series of tutorials for using IOTA on the Internet of Things.**\n\nThe nRF52 series of microcontrollers are an ideal single-chip solution for wearables, toys, smart home devices and appliances, and wireless charging.\n\nWe use this series of microcontrollers in these tutorials because they include Bluetooth and are usually cheap. \n\n1\\. Buy one of the following nRF52 microcontrollers from a specialized electronic retailer\n    \n- nRF52832 breakout board by SparkFun\n- nRF52 development kit \n- nRF52832 micro development kit (tested on these tutorials)\n- nRF52832 module + nRF52832 minimum test board (tested on these tutorials)\n\nWhen you buy a microcontroller, keep the following in mind:\n\n- If your microcontroller does not have an integrated programmer (sometimetimes called a debugger), you'll need to buy a separate one\n- If your microcontroller does not have an integrated USB-to-UART connector (sometimes called a USB to TTL serial connector), you'll need to buy a separate one\n    \n2\\. If you buy a microcontroller that doesn't have an integrated programmer (sometimes called a debugger), buy one and [connect it](../how-to-guides/connect-programmer.md).\n\n\nA programmer is used to flash the code onto the microcontroller. \n[Read more about what a programmer is.](https://www.engineersgarage.com/tutorials/microcontroller-programmer-burner)\n\n:::info:\nIf you want a cheap option for flashing an nRF52 series microcontroller, consider buying a J-Link on-board (OB) clone.\n\nThe standard J-link programmers are more expensive because they can also be used on microprocessors.\n:::\n    \n3\\. If you buy a microcontroller that doesn't have an integrated USB-to-UART connector, buy one and [use it to connect to your microcontroller's serial interface](../how-to-guides/connect-to-serial-interface.md).\n    \n:::info:\nBe sure to buy a connector that's compatible with your operating system.\n:::\n    \n4\\. **Optional:** Buy a breadboard, DuPont cables, and pin headers\n\nThese components are often useful when you're building hardware projects.\nFor example, if you want to connect more than one I2C sensor to a microcontoller that has only one I2C port.\n\n**Breadboard**\n\nA breadboard allows you to make temporary circuits for connecting hardware components without needing to solder them.\n\n![breadboard](/assets/docs/iot/0.1/images/breadboards.png)\n\n**DuPont cables**\n\nDuPont cables are useful for plugging into a breadboard.\n\nYou can usually order DuPont cables in multiples of 10, and they come in different variations such as female-to-female, male-to-female, and male-to-male. We recommended buying a mixture of variations.\n\n![DuPoint cables](/assets/docs/iot/0.1/images/dupont_cable.png)\n\nFrom left to right: female-to-female, male-to-female, male-to-male\n\n**Pin headers**\n\nPin headers allow you to connect your different hardware components.\n\nThe most commonly used header has a male-to-male connection. \n    \n6\\. **Optional:** Buy a single-board computer\n\nA single-board computer (SBC) is often more powerful and has more memory than a microcontroller. As a result, you can use one to connect to your microcontroller or even to run an [IOTA node](/docs/ciri/0.1/how-to-guides/run-a-ciri-node-on-an-sbc).\n\n:::info:\nSome of the cheapest SBCs include the Raspberry Pi Zero or Orange Pi Zero. \nWe recommend a device with Wi-Fi and Bluetooth LE (version >= 4.0) so that you can easily connect to it.\n:::\n\n7\\. Buy an I2C environment sensor such as the Bosch BME/BMP 280 sensor\n\n:::info:\nWe use an operating system called RIOT OS in our tutorials.\n\nBefore buying any other sensors, check the [RIOT OS sensor driver list](http://riot-os.org/api/group__drivers__sensors.html) to make sure that they are supported.\n:::\n\n## Next steps\n\n[Set up your microcontroller](../how-to-guides/set-up-nrf52-microcontroller.md).\n    \n    ","title":"マイクロコントローラー入門 | ハウツーガイド | IoTプロジェクト"}}
