{"path":"docs/general/0.1/how-to-guides/setup-sbc","templateID":1,"sharedPropsHashes":{},"localProps":{"markdown":"# Set up a single-board computer\n\n**A single board computer (SBC) is a small computer in which a single circuit board includes memory, input/output ports, a microprocessor and any other necessary features. SBCs are lighter, more compact, more reliable and much more power efficient then multi-board computers such as desktops. You can set up an SBC for a purpose-built embedded application that uses IOTA technology.**\n\n## Prerequisites\n\nTo complete this guide, you need the following:\n\n- A Linux-based operating system (OS) with installed SSH client and a configured network. \nIn this guide, we use Ubuntu, however other Linux distributions as well as MacOS should work.\n\n    :::info:Windows users\n    You can use [a virtual machine (VM)](../how-to-guides/set-up-virtual-machine.md) \n    or the [Linux Subsystem.](https://docs.microsoft.com/en-us/windows/wsl/install-win10). \n    With the subsystem, you can run Linux without the overhead of a VM. \n    If you are an advanced user, you can also replace the Linux tools with the Windows equivalents.\n    :::\n\n- An SBC. Our recommendation: Rasperry Pi Zero W\n\n- If possible, you should use a display and a keyboard to set up your device.\n\n- If your SBC doesn't have an Ethernet port, use a USB-to-UART adapter. The [CP2102](https://www.silabs.com/products/development-tools/software/usb-to-uart-bridge-vcp-drivers) is a well-known and inexpensive adapter, but your SBC might have an integrated one. To find out, look at the documentation for your SBC.\n\n## Prepare your SD card\n\n:::info:\nThis process is similar for many SBCs such as the Orange Pi. \nIf you have a separate guide for your SBC, you should follow that. Otherwise, use [Armbian](https://www.armbian.com/download/) because it supports many development boards.\n:::\n\nIn single-board computers, the operating system must be flashed onto an SD card.\n\n1. [Flash an operating system on your SD card](https://www.raspberrypi.org/documentation/installation/installing-images/)\n\n2. Insert your SD card and turn on your SBC\n\n## Continue with the setup for your specific device\n\n- If you can use a display and keyboard at your device, follow the [\"Set up devices with keyboard and display\"](#set-up-devices-with-keyboard-and-display) guide\n- If you do not have display and keyboard, but an USB-to-UART-Adapter, follow the [\"Set up your device through a USB-to-UART adapter\"](#set-up-your-device-through-a-usb-to-uart-adapter) guide\n- If you only have Ethernet, follow the [\"Set up Ethernet devices\"](#set-up-ethernet-devices) guide\n\n## Set up devices with keyboard and display\n\n1. Connect keyboard and display to your SBC\n\n2. Log in with the default user and password\n\n    :::info:\n    If you don't know the default username or password, search the website of your Linux distribution.\n    :::\n\n3. Configure your network interface\n\n    If you have Ethernet, just connect your SBC to your router. \n    If you want to use WiFi or your device only has WiFi, you need to connect to your router through WiFi.\n    Do the following and replace `MY_SSID` with the name of your network and `MY_PASSWORD` with the password\n    of your network:\n    \n    ```bash\n    nmcli dev wifi connect MY_SSID password MY_PASSWORD\n    ```\n    \n4. Check if your SBC is connected to the Internet\n    \n    ```bash\n    ping iota.org\n    ```\n\n5. Get your IP address\n\n    Execute the `ifconfig` command. The program returns all network interfaces and the given IP addresses.\n    The interfaces starting with `eth` are Ethernet network interfaces, \n    and the ones starting with `wl` are the WiFi network interfaces.\n\n6. Connect to your device through SSH\n\n    :::info:IPv6\n    If you use IPv6, you must add the `-6` command line argument to the SSH program. \n    You must also add the network interface name. Without the name the client cannot find the SBC.\n    \n    For example:\n    Host-system WiFi interface name: wlp3s0\n    The SBCs' local IPv6 address: fe80::c0a2:76c6:4ed5:a44\n    \n    In this example, the host system and the SBC are both connected to the router through WiFi. \n    You must use the interface which is connected to the correct router.\n    \n    As a result, this is the command to execute for the example:\n    \n    ```bash\n    ssh -6 USERNAME@fe80::c0a2:76c6:4ed5:a442%wlp3s0\n    ``` \n    :::\n    \n    If you found your IP address, you should connect to your SBC through SSH. \n    Use the following command on your host-system:\n    ```bash\n    ssh USERNAME@IP_ADRESS\n    ```\n\n:::success:Congratulations! :tada:\nYou're connected to your SBC through SSH. Now you can run commands on your SBC.\n:::\n\n\n## Set up your device through a USB-to-UART adapter\n\nYou must execute these commands on your host-system.\n\n1. Install PlatformIO\n\n    You need additional software to connect to the serial port. \n    We recommend [PlatformIO](https://docs.platformio.org/en/latest/userguide/cmd_device.html?highlight=monitor#platformio-device-monitor).\n    PlatformIO provides a simple command tool to interact with your SBC.\n\n2. Plug in your USB-to-UART adapter\n\n3. Find the right USB port\n\n    USB ports are available at /dev/ttyUSBX. X is the number of the USB port.\n    The simplest way to find the right USB port is to plug out the USB-Adapter, check for the USB SBCs with\n    ```ls /dev/ttyUSB*```, plug in the USB-Adapter and check again. The new added USB-port is the one you are looking for.\n\n4. Some adapters have an unexpected behavior with their access permissions. Just in case, change the permissions\n\n    ```\n    sudo chmod 777 /dev/ttyUSBX\n    ```\n\n5. Connect to your USB port\n\n    Take a look at the documentation for your SBC to find its baud rate. In case of the Orange Pi Zero it is 115200.\n    ```bash\n    platformio SBC monitor -b BAUD_RATE -p /dev/ttyUSBX\n    ```\n\n6. Restart your SBC\n\n7. Log in to your SBC\n\n    :::info:\n    If you don't know the default username or password, search the website of your Linux distribution.\n    :::\n    \n    When the system asks for it, log in with the default username and password.\n    You should change the root password and create a new user.\n    Most systems require this change after the first login.\n\n8. If available and needed, connect your device to your router through Ethernet\n\n9. If available and needed, configure the WiFi network interface \n\n    If you want to connect to the Internet through WiFi, \n    do the following and replace `MY_SSID` with the name of your network and replace `MY_PASSWORD` \n    with your WiFi password:\n    \n    ```bash\n    nmcli dev wifi connect MY_SSID password MY_PASSWORD\n    ```\n    \n    Check if your SBC is connected to the Internet\n    ```bash\n    ping iota.org\n    ```\n\n10. Get your IP address\n\n    You can now find your IP address with the  `ifconfig` command. \n    The interfaces starting with `eth` are Ethernet network interfaces, \n    and the ones starting with `wl` are the WiFi network interfaces.\n\n11. Connect to your SBC through SSH\n\n    If you found your IP address, you should connect to your SBC through SSH. \n    Use the following command on your host-system:\n    ```bash\n    ssh USERNAME@IP_ADRESS\n    ```\n\n:::success:Congratulations! :tada:\nYou're connected to your SBC through SSH. Now you can run commands on your SBC.\n:::\n\n## Set up Ethernet devices\n\n:::warning:\nThis task is only for IPv4 networks.\n:::\n\nYou must execute these commands on your host-system.\n\n1. Find IP addresses in your local network\n\n    The subnet bytes to be set to zero and the netmask must be set in nmap.\n    So, in my case:\n    Internal IP address: 10.197.0.57\n    Netmask: 255.255.255.0\n    \n    The netmask is 24, because every place in the IP address takes 8 bits (256 states) and the netmask is set on 3 bytes. 3x8=24.\n    \n    ```bash\n    nmap -sn 10.197.0.0/24\n    ```\n    \n    Another example:\n    Internal IP address: 10.197.3.57\n    Netmask: 255.255.0.0\n    \n    So, now it is just 2x8=16. So, you need to use 16 instead of 24.\n    \n    ```bash\n    nmap -sn 10.197.0.0/16\n    ```\n    \n    Depending on the subnet, this process can take some time, since nmap needs to scan all IP addresses within the network. \n    For a small subnet (netmask=24) is just takes some seconds, since nmap just need to scan 256 addresses.\n    In a bigger network that can take more time. For example netmask=16: nmap needs to scan 256*256 addresses. \n    In my test-case this took 2944.17 seconds. If you are in a huge local network, you should consider using another variant.\n\n2. Connect to the IP addresses\n\n    If you found more than one IP address, just try every IP address until you found your address.\n    Use the following command on your host-system:\n    ```bash\n    ssh USERNAME@IP_ADRESS\n    ```\n\n:::success:Congratulations! :tada:\nYou're connected to your SBC through SSH. Now you can run commands on your SBC.\n:::\n","title":"Set up a single-board computer | How-to Guides | 一般"}}
