{"path":"docs/blueprints/0.1/introduction/overview","templateID":1,"sharedPropsHashes":{},"localProps":{"markdown":"# Application blueprints\n\n**Application blueprints explain how you can use IOTA to solve real-world problems and to support well-defined business needs.**\n\nBlueprints are designed to do the following:\n\n* Describe a problem and a solution\n* Present an architecture that shows you how to solve the problem with IOTA\n* Explain how you can test, edit, and deploy the blueprint\n\n-------------------------\n![Data Marketplace](/assets/docs/blueprints/0.1/images/data-marketplace-thumbnail.png)\n## [Data Marketplace](../data-marketplace/overview.md)\nData silos make it difficult to buy and sell data among different data points. To overcome this challenge, the Data Marketplace uses IOTA MAM channels to open up the data silos and allow users to make micropayments of IOTA tokens to the data owners in exchange for data.\n-------------------------\n\n-------------------------\n![Document immutability](/assets/docs/blueprints/0.1/images/document-immutability.png)\n## [Document immutability](../doc-immutability/overview.md)\nDocuments are an important means of transporting information and contracts between parties. Being able to reliably prove that a document has not been changed from an established state helps ensure trust between parties. As well as protect the parties. This blueprint describes a solution that automatically checks the signature of a previously signed document using the IOTA Tangle.\n-------------------------\n\n-------------------------\n![Peer-to-peer energy grid](/assets/docs/blueprints/0.1/images/p2p-energy-grid-thumbnail.png)\n## [Peer-to-peer energy grid](../p2p-energy/overview.md)\nAlthough the supply of energy is often automated, the payment system is expensive to integrate and often requires manual intervention. By creating a peer-to-peer energy grid with IOTA, you can automate the transfer of power and the payment for that power. This automation makes your infrastructure more dynamic and easier to update.\n-------------------------\n\n-------------------------\n![Tangle data storage](/assets/docs/blueprints/0.1/images/tangle-data-storage-thumbnail.png)\n## [Tangle data storage](../tangle-data-storage/overview.md)\nData boosts innovation for public and private sector organisations, and can be used to create new revenue streams. However, without a vendor-neutral way of verifying data, it can't be trusted. This blueprint uses the IOTA Tangle as an immutable data structure to verify the contents of a file in a third-party storage solution.\n-------------------------\n\n-------------------------\n![Track and trace](/assets/docs/blueprints/0.1/images/track-and-trace-thumbnail.png)\n## [Track and trace](../track-and-trace/overview.md)\nDue to a lack of both due diligence and a vendor-neutral data source, returnable assets in distribution networks are often not returned to their original owners. This blueprint describes how the IBCS Group implemented a track and trace system for recovery of returnable assets, using the IOTA Tangle and other IOTA technologies.\n-------------------------\n","title":"Overview | Introduction | アプリの青写真"}}
