{"path":"docs/wallets/0.1/trinity/how-to-guides/protect-trinity-account","templateID":1,"sharedPropsHashes":{},"localProps":{"markdown":"# Protect your Trinity account\n\n**Between 17 December 2019 and 17 February 2020, some users’ Trinity seeds and passwords were compromised during an attack on the wallet. In this guide, you learn what you can do to secure your IOTA tokens.**\n\nTo stop attackers from further transferring IOTA tokens, the IOTA Foundation paused the Coordinator and [released an updated version of Trinity](#install-the-latest-version-of-trinity). This version is no longer vulnerable to the attack.\n\nWhile the [Coordinator](/docs/getting-started/0.1/network/the-coordinator) is paused, no one can transfer their IOTA tokens on the Mainnet.\n\nTo help you to secure your IOTA tokens before the Coordinator is restarted, the IOTA Foundation built the Seed Migration Tool. This tool takes your existing Trinity seed and migrates all your IOTA tokens to a secure, randomly generated one.\n\nDepending on when and how you used the Trinity wallet, you may need to take steps to protect your Trinity account.\n\n**Read the headings below and follow the instructions below the one that best describes you.**\n\n## I use Trinity with a Ledger hardware wallet\n\nSeeds never leave the [Ledger hardware wallet](https://www.ledger.com/), therefore your seed is still safe. However, your Trinity password may have been compromised.\n\n### What to do\n\n[Install the latest version of Trinity and update your password](#install-the-latest-version-of-trinity).\n\n## I use Trinity Mobile\n\nAlthough all evidence points towards mobile not being affected, we cannot totally rule it out at this point. We recommend to use the Seed Migration Tool anyway and change your password as a precaution.\n\n### What to do\n\nAlthough Trinity Mobile was not affected, we recommend that you [migrate your IOTA tokens to a new seed](#migrate-your-iota-tokens-to-a-new-seed).\n\n## I have not opened Trinity Desktop since 16 December 2019\n\nThe attack affected users who opened Trinity Desktop version 1.2.0, 1.2.1, and 1.2.2 between 17 December 2019 and 17 February 2020.\n\nIf you did not open Trinity in this timeframe, your seed, username, and password are safe.\n\n### What to do\n\n[Install the latest version of Trinity Desktop and update your password](#install-the-latest-version-of-trinity).\n\nAlthough you were not affected, we recommend that you [migrate your IOTA tokens to a new seed](#migrate-your-iota-tokens-to-a-new-seed).\n\n## I know that my IOTA tokens were stolen during this attack\n\nUnfortunately, the attacker managed to steal IOTA tokens from some users' Trinity accounts.\n\nTo prevent any further movement of the stolen IOTA tokens, the IOTA Foundation has notified all exchanges.\n\n### What to do\n\nPlease join our [Discord](https://discord.iota.org/) and message an IOTA Foundation member directly.\n\n## I’m not sure\n\nFor anyone else, you should assume that your Trinity seed and password are no longer secret. Therefore, when the Coordinator is restarted, your IOTA tokens may be at risk.\n\n### What to do\n\n1. [Install the latest version of Trinity and update your password](#install-the-latest-version-of-trinity)\n2. [Migrate your IOTA tokens to a new seed](#migrate-your-iota-tokens-to-a-new-seed)\n\n---\n\n## Install the latest version of Trinity\n\nIn this step, you upgrade the Trinity wallet to the latest version.\n\n1. [Download and install the latest version of Trinity](https://trinity.iota.org/) by clicking the **Download** button in the right-hand corner and selecting your operating system\n\n    By installing this version, you overwrite any existing versions.\n\n    ![Download Trinity](/assets/docs/wallets/0.1/trinity/images/download-trinity.png)\n\n2. Open Trinity and go to **Trinity** > **Settings** > **Change password** to change your existing password\n\n3. If you have used the same password for other services or websites, change those as well\n\n:::success:\nYou've downloaded the latest version of Trinity. This version no longer has the vulnerability.\n:::\n\n## Migrate your IOTA tokens to a new seed\n\nIn this step, you use the Seed Migration Tool to migrate your IOTA tokens to a new seed.\n\n:::info:\nDue to technical limitations, only balances of over 1 Mi can be migrated to a new seed with this tool.\n:::\n\n1. [Download the Seed Migration Tool](http://status.iota.org/)\n\n    Please make sure to check that the URL in the address bar is http://status.iota.org/\n\n2. If you are using Linux, you need to [make the downloaded file executable](https://medium.com/@peey/how-to-make-a-file-executable-in-linux-99f2070306b5).\n\n3. Open the Seed Migration Tool, and either import your existing SeedVault file or enter your seed manually\n\n    :::info:\n    To find your existing seed in Trinity, go to **Account** > **Account management** >  **View seed**. Here, you can export your seed to a SeedVault file or see it in plain text.\n    :::\n\n    ![Seed Migration home page](/assets/docs/wallets/0.1/trinity/images/seed-migration-home.png)\n\n4. Make sure your displayed balance is correct\n\n    The displayed balance is the balance the tool could find on your seed’s addresses.\n\n    :::info:\n    This is the total amount of IOTA tokens which will be migrated to your new seed.\n    :::\n\n5. If you think your balance is wrong, or you know that you have IOTA tokens on more addresses, click **Scan more addresses**\n\n    The tool will check the balance of 50 more addresses each time you click this button.\n\n    ![Seed migration balance](/assets/docs/wallets/0.1/trinity/images/seed-migration-balance.png)\n\n6. Follow the prompts to generate a seed and save it to a SeedVault file\n\n    :::info:\n    The tool randomly generates a new seed for you. If you want to choose your own seed or use a Ledger hardware wallet, make sure to use the tool first, and then [create a new seed in Trinity](../how-to-guides/create-an-account.md) after the Coordinator is restarted.\n    :::\n\n7. Save your migration log file\n\n    This file contains details about the transactions that migrate the IOTA tokens to your new seed. You can use this file to check the status of your migration. Keep this log safe!\n\n    ![Migration log file](/assets/docs/wallets/0.1/trinity/images/seed-migration-log.png)\n\n8. Click **Begin Migration** to migrate all your IOTA tokens to the first address of your new seed\n\n    The migration may take a minute. If you close the window before the migration is finished, you may need to go through the [Identity Verification Process](../references/faq.md#what-is-the-idenitity-verification-process).\n\n    :::info:\n    When your migration is finished, it will be sent to the IOTA Foundation’s server, where it will be given priority for confirmation when the Coordinator is restarted.\n    :::\n\n    Your migration can have one of the following migration statuses:\n\n    **Secured:** The Coordinator has confirmed your migration. You are free to send value transactions, using your new seed.\n\n    **Submitted:** Your migration is waiting to be processed. Check back after the migration period because further action may be required.\n\n    **ID Required:** Someone else tried to use the Seed Migration Tool with your seed. Please see the [Identity Verification Process](../references/faq.md#what-is-the-idenitity-verification-process) for more information. You will need your migration log file.\n\n    Make sure you check the status page after the migration period because further action may be required.\n\n9. Open Trinity and [create a new account](../how-to-guides/create-an-account.md), using your new SeedVault file\n\n    :::info:\n    Until the Coordinator is restarted, your new seed’s balance will be 0. After the Coordinator is restarted, your transfers will be confirmed and you will see your correct balance.\n    :::\n\n10. To see your new seed, go to **Account** > **Account management** >  **View seed**, and enter the password you created in step 5\n\n    ![View seed](/assets/docs/wallets/0.1/trinity/images/view-seed.png)\n\nYou can repeat this process for any other seeds that you own.\n\n:::danger:\nDo not repeat this process for the same seed again. Otherwise, you may need to go through the [Identity Verification Process](../references/faq.md#what-is-the-idenitity-verification-process).\n:::\n\n:::success:\nYou've migrated your IOTA tokens to a new seed.\n\nNow, you just need to wait until the Coordinator is restarted for your transactions to be confirmed.\n:::\n\n## Next steps\n\nIf you have any questions, check the [FAQ](../references/faq.md) or reach out to the IOTA community in the #help channel on [Discord](https://discord.iota.org/).\n\nIf you want to use a Ledger hardware wallet, see [the guide on the official Trinity website](https://trinity.iota.org/hardware/).\n","title":"Trinity アカウントを保護する | ハウツーガイド | Trinity | ウォレット"}}
