{"path":"docs/contributing/0.1/documentation/contribution-guidelines","templateID":1,"sharedPropsHashes":{},"localProps":{"markdown":"# Contribute to the developer documentation\n\nThis document describes how to contribute to the IOTA developer documentation.\n\nWe encourage everyone with knowledge of IOTA technology to contribute.\n\nThanks! :heart:\n\n\n## Do you have a question :question:\n\n\nIf you have a general or technical question, you can use one of the following resources instead of submitting an issue:\n\n- [**Discord:**](https://discord.iota.org/) For communicating with the developers and community members\n- [**IOTA cafe:**](https://iota.cafe/) For discussing technical questions with the Research Department at the IOTA Foundation\n- [**StackExchange:**](https://iota.stackexchange.com/) For asking technical questions\n\n\n\n\n\n## Ways to contribute :mag:\n\n\nTo contribute, you can:\n\n- Report a mistake\n- Suggest new content\n- Write new content\n- Suggest a new documentation feature\n\n\n\n\n\n## Report a mistake :bug:\n\n\nThis section guides you through reporting a typo or any type of mistake in the content. Following these guidelines helps maintainers and the community verify and and fix mistakes.\n\n### Before reporting a mistake\n\nPlease check the following list:\n\n- **Ensure the mistake has not already been reported** by searching on GitHub under [**Issues**](https://github.com/iotaledger/documentation/issues). If the mistake has already been reported **and the issue is still open**, add a comment to the existing issue instead of opening a new one.\n\n:::info:\nIf you find a **Closed** issue that seems similar to what you're experiencing, open a new issue and include a link to the original issue in the body of your new one.\n:::\n\n### Reporting a mistake\n\nTo report a mistake, [open a new issue](https://github.com/iotaledger/documentation/issues/new), and be sure to include as many details as possible, using the template.\n\nIf you also want to fix the mistake, submit a [pull request](#pull-requests) and reference the issue.\n\n\n\n## Suggest new content :bulb:\n\n\nThis section guides you through suggesting new content. Following these guidelines helps maintainers and the community collaborate to find the best possible way forward with your suggestion.\n\n### Before suggesting new content\n\n**Ensure the suggestion has not already been suggested** by searching on GitHub under [**Issues**](https://github.com/iotaledger/documentation/issues).\n\n### Suggesting new content\n\nTo suggest new content, talk to the IOTA community and IOTA Foundation members in the #documentation-discussion channel on [Discord](https://discord.iota.org/).\n\nIf your suggestion is approved, the team will create an issue to include it.\n\n\n\n\n\n## Write new content :pencil2:\n\n\nThis section guides you through writing content for the documentation portal. Following these guidelines helps give your content the best chance of being approved and merged.\n\n### Before writing\n\nMake sure to discuss your idea in the #documentation-discussion channel on [Discord](https://discord.iota.org/).\n\nOtherwise, your content may not be approved at all.\n\n### Writing new content\n\nTo build a new feature, check out a new branch based on the `develop` branch, and be sure to consider the following:\n\n- Choose an appropriate location for your content\n- Follow the [documentation style guide](../documentation/style-guide.md)\n\n## Suggest a new documentation feature\n\nTo suggest new features for the documentation portal:\n\n1. Go to the [`iotaledger/documentation-platform`](https://github.com/iotaledger/documentation-platform/issues) repository\n2. If no existing issues address your suggestion, create a new issue and describe your feature idea\n\n## Get started with your first contribution\n\nOur documentation is hosted on GitHub, which is a version control tool. To create new content, or suggest changes to existing content, you must use either Git or GitHub.\n\nIf you already have a GitHub account and Git is set up on your device, go straight to [Create a new branch](#create-a-new-branch).\n\n1. [Create a new GitHub account](https://github.com/) if you don't already have one\n\n2. [Set up Git](https://help.github.com/articles/set-up-git/)\n\n3. Go to our [documentation repository](https://github.com/iotaledger/documentation.git) and click **Fork** at the top of the page\n\n4. Copy your fork to your local machine by doing the following in a command-line interface. Replace the `$USERNAME` placeholder with your GitHub username\n\n    ```bash\n    git clone https://github.com/$USERNAME/documentation\n    ```\n\n5. Create a reference to our repository from your fork\n\n    ```bash\n    cd documentation\n    git remote add upstream https://github.com/iotaledger/documentation.git\n    git fetch upstream\n    ```\n\nNow, your `documentation` directory will contain all the documentation files.\n\nTo find an existing article, you can use the URL of the documentation portal as a reference. The path to the article comes after `docs`.\n\nFor example, to find the article about minimum weight magnitude, which has the following URL, you would look in the `getting-started/0.1/network` directory, and find the article called `minimum-weight-magnitude.md`:\n\n```\nhttps://docs.iota.org/docs/getting-started/0.1/network/minimum-weight-magnitude\n```\n\n### Create a new branch\n\nBranches help us to review content by separating your contributions into categories.\n\nThe following types of contribution are appropriate for a new branch:\n\n- A new article (a single markdown file)\n- Grammar edits and spelling corrections, and any other suggestions for an existing article\n\n1. Open a command-line interface\n\n2. Do the following. Replace the `$BRANCH` placeholder with your own branch name\n\n    ```bash\n    git pull upstream develop:$BRANCH\n    git push origin $BRANCH\n    ```\n\n3. To start working on your local copy of the branch, do the following:\n\n    ```bash\n    git checkout $BRANCH\n    ```\n\nPlease follow our [style guide](../documentation/style-guide.md) when you write and edit articles.\n\n### Validate your content\n\nTo make sure that you haven't introduced spelling errors or broken links, the next step is to validate your content.\n\n1. [Install Node.js](https://nodejs.org/en/download/)\n\n2. In the `documentation` directory, install the dependencies\n\n    ```bash\n    npm install\n    ```\n\n3. Run the `buildProjects` script\n\n    ```bash\n    node buildProjects\n    ```\n\nThis script will do the following:\n\n- Print errors to the console\n- Create a `projects-summary.log` file, which shows the structure of the content and also highlights the errors\n- Create a spelling-summary.md file, which contains any possible spelling mistakes and suggestions\n\nTo enhance the [Hunspell](https://en.wikipedia.org/wiki/Hunspell) spell checker, you can add words to the dictionary.json file, which supports regular expressions. For example:\n\n```json\n{\n    \"global\": [\n        \"(P|p)ermission(less|ed)\"\n    ],\n    \"smartcity\": [\n        \"AstroPi\"\n    ]\n}\n```\n\nIf you made changes to a single directory, you can validate it alone by adding its name to the end of the `node buildProjects` command. For example, to validate only the content in the `getting-started` directory, you'd do the following:\n\n```shell\nnode buildProjects getting-started\n```\n\n### Push your content to our GitHub repository\n\nAfter writing or editing content and validating it, the next step is to push it to our repository.\n\n1. Add your changes\n\n    ```bash\n    git add .\n    ```\n    \n    :::info:\n    You may be asked to set your account's default identity.\n    :::\n  \n    ```bash\n    Please tell me who you are\n    Run \n    git config --global user.email \"you@example.com\"\n    git config --global user.name \"Your Name\"\n    ```\n    \n2. Commit your changes\n\n    ```bash\n    git commit -m \"<Describe the changes you made>\"\n    ```\n\n    :::info:\n    Make any additional changes to the same files in subsequent commits as you work. Not all changes need to be in the same commit.\n    :::\n\n3. Push your changes\n\n    ```bash\n    git push origin <your branch name>\n    ```\n    \n4. In GitHub, go to the repository that you forked from `iotaledger/documentation`, and click **Pull Request** at the top of the page\n\n5. Make sure that the base branch is `iotaledger/documentation@develop` and the head branch is `$USERNAME/documentation@$BRANCHNAME`\n\n6. Click **Update Commit Range** or **Compare & pull request**\n\n7. Give your pull request a title, and describe all the changes you're making\n\n8. Click **Submit**\n\n:::success: Thank you :tada:\nWe will now process your pull request. If there are any edits to make, we will ask you in the comments of the pull request you created. \n\nYou can continue pushing new changes like you did before. Any updates will appear in the pending pull request.\n:::\n\n## Pull requests\n\nThis section guides you through submitting a pull request (PR). Following these guidelines helps give your PR the best chance of being approved and merged.\n\n### Before submitting a pull request\n\nWhen creating a pull request, please follow these steps to have your contribution considered by the maintainers:\n\n- A pull request should have exactly one concern (for example one feature or one bug). If a PR address more than one concern, it should be split into two or more PRs.\n\n- A pull request can be merged only if it references an open issue\n\n    :::info:\n    Minor changes such as fixing a typo can but do not need an open issue.\n    :::\n\n- All code should be well tested\n\n### Submitting a pull request\n\nThe following is a typical workflow for submitting a new pull request:\n\n1. Fork this repository\n2. Create a new branch based on your fork\n3. Commit changes and push them to your fork\n4. Create a pull request against the `develop` branch\n\nIf all [status checks](https://help.github.com/articles/about-status-checks/) pass, and the maintainer approves the PR, it will be merged.\n\n:::info:\nReviewers may ask you to complete additional work, tests, or other changes before your pull request can be approved and merged.\n:::\n\n## Code of Conduct\n\nThis project and everyone participating in it is governed by the [IOTA Code of Conduct](https://www.iota.org/contact-us/community-support).\n","title":"Contribute to the docs | Documentation | 貢献"}}
