{"path":"docs/node-software/0.1/iri/how-to-guides/configure-iri","templateID":1,"sharedPropsHashes":{},"localProps":{"markdown":"# Plan your IRI configuration\n\n**Before you run IRI, you should consider whether you need to override some of its default settings. This guide gives you some advice about what to consider.**\n\n:::info:\nYou must stop IRI before making any configuration changes.\n:::\n\n## Are you planning on accessing your node on the Internet?\n\nIf you want to access your node's API from any network, you must expose its API to the Internet by using one of the following options:\n\n- [Set up a reverse proxy](../how-to-guides/set-up-a-reverse-proxy.md)\n- Open port 14265 on your server and set the [`API_Host`](../references/iri-configuration-options.md) configuration option to 0.0.0.0\n\nIf you just want to access your node's API on your local network, you can use the default configuration settings.\n\n## Which IOTA network do you want to use?\n\nThe IOTA network in which your node runs is determined by the following configuration options:\n\n- [`MWM`](../references/iri-configuration-options.md#mwm)\n- [`NEIGHBORS`](../references/iri-configuration-options.md#neighbors)\n- [`TESTNET`](../references/iri-configuration-options.md#testnet)\n\n### MWM\n\nThe [minimum weight magnitude](/docs/getting-started/0.1/network/minimum-weight-magnitude) (MWM) is important because nodes use this setting to determine whether transactions are valid. To be valid, transactions must contain a [proof of work](/docs/getting-started/0.1/transactions/proof-of-work) that used at least the MWM in the node's configuration.\n\n### NEIGHBORS\n\nThe neighbors to which your node connects must use either the same minimum weight magnitude as your node or a higher one.\n\nIf one of your neighbors accepts transactions with a MWM of 9 and your node accepts transactions with a MWM of 14, you and your neighbor will have two different views of the Tangle.\n\n### TESTNET\n\nThe `TESTNET` configuration option determines whether your node runs on the Mainnet.\n\nIf you set this option to `true`, your node will be configured to run on the Devnet by default. You don't need to change any other testnet options because the defaults set up IRI to listen to the Devnet Coordinator and accept transactions with a [minimum weight magnitude] of 9.\n\nTo run on another network such as a private Tangle, you must configure the other testnet options. For example, you must configure your node to recognize the Coordinator's address in your network and accept transactions with your chosen  minimum weight magnitude. \n\n## Do you want your node to do proof of work?\n\n[Proof of work](/docs/getting-started/0.1/transactions/proof-of-work) (PoW) is a resource-intensive operation that uses computational power on your device.\n\nAllowing your node to do remote PoW, means that anyone who sends a request to the [`attachToTangle`](../references/api-reference.md#attachToTangle) endpoint can ask your node to do proof of work for their transactions.\n\nBy default, the `attachToTangle` endpoint is disabled in the `REMOTE_LIMIT_API` configuration option.\n\nIf you want to enable this option only for certain users, you can remove it from the `REMOTE_LIMIT_API` configuration option, and [set up a reverse proxy server](../how-to-guides/set-up-a-reverse-proxy.md) to limit calls to the `attachToTangle` endpoint to certain IP addresses. Or, you can [install a proof of work proxy server](/docs/utils/0.1/official/proof-of-work-proxy/overview) to intercept calls to your node's `attachToTangle` endpoint.\n\n## Do you want to keep all transactions in the ledger?\n\nOver time, the ledger of an IRI node accumulates many transactions, which often cause it to become larger than its available memory. To stop the ledger from becoming too large, you can choose to delete old transactions at regular intervals in local snapshots.\n\n:::info:\nLocal snapshots are available only in version 1.6.0 and later of the IRI.\n:::\n\nDuring a local snapshot, an IRI node can delete transactions from its ledger if they were confirmed by an old milestone.\n\nAn old milestone is one that has an index greater than the combined value of the [`LOCAL_SNAPSHOTS_DEPTH`](../references/iri-configuration-options.md#local-snapshots-depth) and [`LOCAL_SNAPSHOTS_PRUNING_DELAY`](../references/iri-configuration-options.md#local-snapshots-pruning-delay) configuration options.\n\nIf you want to delete old transactions, you need to make sure that the [`LOCAL_SNAPSHOTS_ENABLED` and the `LOCAL_SNAPSHOTS_PRUNING_ENABLED`](../references/iri-configuration-options.md#local-snapshots) configuration options are set to `true`. Then, change the values of the `LOCAL_SNAPSHOTS_PRUNING_DELAY` and the `LOCAL_SNAPSHOTS_DEPTH` configuration options, depending on how long you want to keep transactions in the ledger.\n\nMilestones are sent approximately every two minute. So, use the following formula to calculate the number of days that new transactions will remain in the ledger:\n\n- **Total milestone index:** `LOCAL_SNAPSHOTS_PRUNING_DELAY` + `LOCAL_SNAPSHOTS_DEPTH` \n\n- **Total time in minutes:** Total milestone index / 120\n\n- **Total time in days:** Total time in minutes / 24\n\n### Example of deleting old transaction from the ledger\n\n**Configuration parameters:**\n\n- `LOCAL_SNAPSHOTS_PRUNING_DELAY` = 50,000\n- `LOCAL_SNAPSHOTS_DEPTH` = 100\n\n**Current milestone index:**\n\n- 990, 100\n\nIn this scenario, the sum of `LOCAL_SNAPSHOTS_PRUNING_DELAY` + `LOCAL_SNAPSHOTS_DEPTH` is 50, 100. Therefore, the node will prune transactions that were confirmed by any milestone with an index lower than 940, 000 (990, 100 - 50,100). As a result all transactions between milestones 940, 000 and 990, 100 will be kept in the ledger.\n\n## Do you want to create snapshot files?\n\nAfter a snapshot, nodes store the state of the ledger in snapshot files, which any node can use as an entry point during synchronization.\n\nIf you want to create snapshot files, you need to make sure that the [`LOCAL_SNAPSHOTS_ENABLED`](../references/iri-configuration-options.md#local-snapshots) configuration option is set to `true`. Then, change the value of the `LOCAL_SNAPSHOTS_DEPTH` configuration option, depending on how often you want to create snapshot files.\n\nIf an IRI node is synchronized, it creates snapshot files at the milestone intervals that are defined in the [`LOCAL_SNAPSHOTS_INTERVAL_SYNCED`](../references/iri-configuration-options.md#local-snapshots-interval-synced) configuration option.\n\nIf an IRI node isn't synchronized, it creates snapshot files at the milestone intervals that are defined in the [`LOCAL_SNAPSHOTS_INTERVAL_UNSYNCED`](../references/iri-configuration-options.md#local-snapshots-interval-unsynced) configuration option.\n\n:::info:\nAt each interval, the snapshot file is overwritten.\n:::\n\nLocal snapshots result in the following snapshot files:\n- **snapshot.meta:** [Transaction data that the IRI uses to start synchronizing its ledger with neighbor IRI nodes](../references/data-in-the-snapshot-metadata-file.md)\n- **snapshot.state:** A list of all addresses that have a balance greater than 0 at the time of the local snapshot.\n\n:::info:\nThese files are located in the path of the [`LOCAL_SNAPSHOTS_BASE_PATH`](../references/iri-configuration-options.md#local-snapshots-base-path) configuration option.\n:::\n\n#### Example of creating snapshot files\n\n**Configuration parameter:**\n\n- `LOCAL_SNAPSHOTS_DEPTH` = 100\n- `LOCAL_SNAPSHOTS_INTERVAL_SYNCED` = 10\n\n**Current milestone index:**\n\n- 990, 100\n\nIn this scenario, the IRI node is synchronized. So, at milestone 990, 110, the node will do the following:\n\n- Take the previous 100 milestones and add them to the snapshot.meta file as [seen milestones](../references/data-in-the-snapshot-metadata-file.md#seen-milestone)\n- Find the solid transactions and add them as [solid entry points](../references/data-in-the-snapshot-metadata-file.md#solid-entry-point)\n- In the snapshot.state file, add a list of all addresses and their balances\n\nWhen the IRI node restarts, it can use the snapshot files as the entry point to synchronize its ledger.\n\n## Next steps\n\n[Install and run IRI](../how-to-guides/install-iri.md).","title":"IRI の構成を計画する | ハウツーガイド | IRI | ノードソフトウェア"}}
