{"path":"docs/iot/0.1/nrf52/introduction/get-started","templateID":1,"sharedPropsHashes":{},"localProps":{"markdown":"# Get started with the nRF52\n\n**The nRF52-series of microcontrollers are an ideal solution for wearables, toys, smart home devices and appliances, and wireless charging. We use this series of microcontrollers because they include Bluetooth and are usually cheap. In this guide, you learn how to get started with the nRF52-series of microcontrollers. When you've completed this guide, you'll be able to follow our series of tutorials for using IOTA on the Internet of Things.**\n\n## Hardware\n\nTo complete this guide, you need a Linux PC.\n\nWe recommend that you buy the following useful components for building circuits:\n\n- **Breadboard:** Allows you to make temporary circuits for connecting hardware components without needing to solder them.\n\n- **DuPont cables (female-to-female, male-to-female, and male-to-male connectors)** Allow you to connect devices through pin headers or a breadboard.\n\n**Pin headers (male-to-male and male-to-female connectors):** Allow you to connect your different hardware components to the microcontroller\n\n## Step 1. Choose a microcontroller\n\nMany companies manufacture and distribute nRF52-series microcontrollers. For example, the following options are available:\n\n- nRF52832 module and an nRF52832 minimum test board (tested with these tutorials)\n- nRF52832 breakout board by SparkFun\n- nRF52832 development kit (DK)\n- nRF52832 micro development kit (MDK)\n\nDevelopment kits are often the most expensive option because they include useful features such as a labelled pins, a programmer, and a USB-to-UART connector.\n\nThe modules alone are often the cheapest option, but they are difficult to set up because they require more knowledge of circuits. As a result, in these guides, we assume that you have a board.\n\nWhen choosing a microcontroller, you should consider the following questions:\n\n### Is the programmer integrated on the board?\n\nA programmer (sometimes called a debugger) is a device that is used to transfer the machine code from a PC to a microcontroller's flash memory.\n\nIf your microcontroller does not have an integrated [programmer](https://www.engineersgarage.com/how-to-guides/microcontroller-programmer-burner), you'll need to [choose one to buy and wire it to the microcontroller](../setup-guides/connect-programmer.md).\n\n### Is the USB-to-UART integrated on the board?\n\nTo read the output of your microcontroller, you need to be able to receive and transmit data through its serial interface. To access the serial interface on a microcontroller, you need a USB-to-UART connector (sometimes called a USB to TTL serial connector). Some development boards include an integrated USB-to-UART connector, but others do not.\n\nIf your microcontroller does not have an integrated USB-to-UART connector (sometimes called a USB to TTL serial connector), [choose one to buy and wire it to the microcontroller](../setup-guides/connect-to-serial-interface.md).\n\n### Are the pins soldered onto the board?\n\nTo connect components to your microcontroller, your board needs pins, which may come connected or disconnected.\n\nIf the pins aren't connected to the board, you'll need to solder them on. Pimoroni has a [useful soldering guide](https://learn.pimoroni.com/tutorial/sandyj/the-ultimate-guide-to-soldering).\n\n## Step 2. Set up your development environment\n\nBefore you can start using your microcontroller, you need to install the necessary tools on your Linux PC so that you can flash code onto it.\n\n1. Install Git\n\n    ```bash\n    sudo apt install git-all\n    ```\n\n2. [Install the ARM toolchain](../setup-guides/install-arm-gcc-toolchain.md)\n\n3. [Install OpenOCD](https://github.com/RIOT-OS/RIOT/wiki/OpenOCD)\n\n    OpenOCD includes scripts to make it easy to flash the binary onto your microcontroller\n\n4. Install Python 3 and the package manager\n\n    ```bash\n    sudo apt-get install -y python3-all\n    sudo apt-get install -y python-pip3\n    ```\n\n5. If your Linux distribution has Python 2 pre-installed, make sure that it uses Python 3 by default\n\n    ```bash\n    echo \"alias python=python3\" >> ~/.bashrc\n    ```\n\n6. Install one of these programmer toolchains, depending on the programmer that you're using\n\n   **Option 1:** [Install the J-Link or J-Link OB toolchain](https://gnu-mcu-eclipse.github.io/debug/jlink/install/)\n\n   **Option 2:** [Install the DAPLink toolchain](https://github.com/mbedmicro/pyOCD#installing). Make sure that you install this toolchain using the `pip3` command.\n\n## Step 3. Test your microcontroller\n\nAfter setting up your microcontroller with all the necessary software, you can test it by running the 'hello world' program that comes with the [RIOT operating system](https://www.riot-os.org/) (RIOT OS).\n\n1. Clone our forked RIOT OS repository and change into the `BLE-environment-sensor/examples/hello-world` directory\n\n    ```bash\n    git clone https://github.com/iota-community/BLE-environment-sensor.git\n    cd BLE-environment-sensor/examples/hello-world\n    ```\n\n2. Find the path to your USB-to-UART connector by removing it, executing the `ls /dev/ttyUSB*` command, plugging the USB-to-UART connector back into your PC, then executing the `ls /dev/ttyUSB*` command again. The new entry is your connector.\n\n3. Change the permissions for your USB-to-UART connector. Replace the `$USB_PORT` placeholder with the path to your USB-to-UART connector such as `/dev/ttyUSB0`.\n\n    ```bash\n    sudo chmod 777 $USB_PORT\n    ```\n\n4. Flash the 'hello world' program onto your microcontroller. Replace the `$BOARD` AND `$USB_PORT` placeholders with the name of your board and the path to your USB-to-UART connector such as `/dev/ttyUSB0`\n\n    ```bash\n    BOARD=BOARD PORT=/dev/ttyUSB0 make flash term\n    ```\n\n    :::info:\n    To [find the name of your board](https://api.riot-os.org/group__boards.html), see the RIOT documentation.\n    :::\n\n    You should see something like the following in the shell:\n\n    ```\n    2019-08-27 09:17:09,359 - INFO # main(): This is RIOT! (Version: 2019.10-devel-488-g1b1c9)\n    2019-08-27 09:17:09,359 - INFO # Hello World!\n    2019-08-27 09:17:09,361 - INFO # You are running RIOT on a(n) nrf52832-mdk board.\n    ```\n\n:::success: Congratulations :tada:\nYou just compiled code and flashed it onto your microcontroller. Now, you're ready to build some real applications.\n:::\n\n## Troubleshooting\n\nThese are known issues that you may find while following this guide and some suggested steps to resolve them.\n\n### Permission denied\n\nIf you're using a DAPLink programmer, create a udev rule by doing the following:\n\n1. Clone the pyOCD repository\n\n  ```bash\n  git clone https://github.com/mbedmicro/pyOCD.git\n  ```\n\n2. Change into the `pyOCD/udev` directory\n\n  ```bash\n  cd pyOCD/udev\n  ```\n\n3. [Follow the pyOCD instructions](https://github.com/mbedmicro/pyOCD/tree/master/udev) for creating a udev rule\n\nNow, try and flash your microcontroller again.\n\n### arm-none-eabi-gcc version not supported\n\nInstall the latest version of the toolchain by doing the following:\n\n1. Uninstall the old toolchain packages\n\n  ```bash\n  sudo apt remove binutils-arm-none-eabi gcc-arm-none-eabi libnewlib-arm-none-eabi\n  ```\n\n2. [Download the latest toolchain from developer.arm.com](https://developer.arm.com/tools-and-software/open-source-software/developer-tools/gnu-toolchain/gnu-rm/downloads)\n\n3. Untar the toolchain in your `home` directory. Replace the `$FILENAME` placeholder with the name of the file that you downloaded\n\n  ```bash\n  tar -xjvf $FILENAME\n  ```\n\n4. Add the toolchain to your path. Replace the `$PATHTOFILE` placeholder with the path to your untarred toolchain\n\n  ```bash\n  echo \"export PATH=$PATH:/home/$PATHTOFILE/bin/\" >> ~/.bashrc\n  ```\n\n5. Close the terminal window, and open a new one\n\nNow, you have a supported version of the toolchain\n\n### Recipe for target 'flash' failed\n\nWhen you use a J-Link OB clone for the first time, you may see the following message:\n\n```bash\nrecipe for target 'flash' failed\nmake: *** [flash] Error 1\n```\n\nThis error is caused because the first time you use a J-Link OB clone, it upgrades itself and fails to flash. \n\nTry and flash a second time and it should succeed.\n\n### No connected debug probes\n\nIf you're using an external programmer, make sure that it is connected.\n\n## Next steps\n\nFollow one of the our guides:\n\n- [Read data from a sensor on your microcontroller](../how-to-guides/read-sensor-data.md)\n- [Set up a Bluetooth star network](../how-to-guides/set-up-a-bluetooth-star-network.md)\n- [Attach sensor data to the Tangle](../iota-projects/run-an-environment-to-tangle-app.md)\n","title":"nRF52 入門 | 序説 | nRF52 | IoT プロジェクト"}}
