{"path":"docs/node-software/0.1/chronicle/references/data-model","templateID":1,"sharedPropsHashes":{},"localProps":{"markdown":"# Scylla data model\n\n**This section describes the data model of the Scylla database for Chronicle.**\n\nThe ScyllaDB data model includes the following tables:\n\n- **Bundle:** Stores transaction bundles\n\n- **Edge:** Provides secondary indexes\n\n- **Tag:** Limits the amount of time you can search by tag\n\n- **Zero-value:** Stores spam and data transactions by month\n\nWe use the following abbreviations to describe the data in these tables:\n\n|**Abbreviation**|**Description**|\n|:------------|:------------|\n|BH|Bundle hash|\n|H_hash|Head hash (IX == LX)|\n|TS|Timestamp|\n|TX_HASH|Transaction hash|\n|TTL|Time to live|\n|EL|Extra Label|\n|EX|Extra Vertex|\n|LB|Label|\n|V1|Vertex One|\n|V2|Vertex Two|\n|IX|Current Index|\n|LX|Last Index|\n|SX|Snapshot Index|\n\n## Bundle table\n\nThe bundle tables stores all bundle data in the following fields:\n\n- `bundle_hash`: Main partition key. All bundles with same bundle hash are stored in the same partition and replicated on the same replicas.  \n\n- `outputs`: Address used in a transaction with a value that is equal to or greater than 0\n\n- `inputs`: Address used in a transaction with a value that is less than 0\n\n- `transactions_hashes`: Transaction hashes in the bundle\n\n![bundle table sample](/assets/docs/node-software/0.1/chronicle/images/bundle-table.png)\n\n## Edge table\n\nThe edge tables stores transaction data, where the partion key can be any of the following fields:\n\n- `address`: Address that was used in a bundle\n\n- `transaction_hash`: Transaction hash\n\n- `tip`: Trunk or branch transactions of the head transaction of the bundle\n\n![edge table sample](/assets/docs/node-software/0.1/chronicle/images/edge-table.png)\n\nAll the rows with the same partition key are stored in the same partition and replicated across the same replicas. This allows you to look up data by any partition key.\n\n## Tag table\n\nA tag table can be one of two types:\n\n- Full tag (27 trytes)\n\n- Full tag and IOTA area code\n\t\nAny number of transactions can have the same tag. As a result, this table can become too large for any node to store. One solution is to remove transactions after a given period of time. For example, the tag table has a predefined TTL which acts as a real-time index. When the TTL is set to 1000 seconds, the row will be deleted after that time. Searches by tag only work for transactions that were saved before the TTL.\n\n## Zero_value table\n\nThis table stores the same data as the edge table, except the partition key is a composite partition key composed of address, year, month. This means only the monthly activities for that address will exist in the same shard. \n","title":"データモデル | 参考文献 | クロニクル | ノードSW"}}
